<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions revision="1.1" schemaVersion="1.0">
	<policyNamespaces>
		<target prefix="receiver" namespace="receiver.Policies.receiver"/>
	</policyNamespaces>
	<!-- The supersededAdm element references an ADM file name to be replaced by an ADMX file. GPO editor will not read any ADM file designated as superseded. -->
	<supersededAdm fileName="icaclient.adm"/>
	<supersededAdm fileName="icaclient_usb.adm"/>
	<supersededAdm fileName="ica-file-signing.adm"/>
	<resources minRequiredRevision="1.0"/>
	<supportedOn>
		<definitions>
			<definition name="SUPPORTED_NotSpecified" displayName="$(string.ADMXMigrator_NoSupportedOn)"/>
			<definition name="SUPPORTED_Platform" displayName="$(string.ADMXPolicy_SupportedOn)"/>
			<definition name="SUPPORTED_Platform_SmartCardRemovalAction" displayName="$(string.ADMXPolicy_SupportedOn_Explain_SmartCardRemovalAction)"/>
			<definition name="SUPPORTED_Platform_AppProtection" displayName="$(string.ADMXPolicy_SupportedOn_Explain_AppProtection)"/>
			<definition name="SUPPORTED_Platform_EdgeChromium" displayName="$(string.Policy_Enable_EdgeChromium_SupportedOn)"/>
		</definitions>
	</supportedOn>
	<categories>
		<category name="CITRIX_COMPONENTS" displayName="$(string.CITRIX_COMPONENTS)" explainText="$(string.CITRIX_COMPONENTS_HELP)"/>
		<category name="ICAClient" displayName="$(string.ICAClient)" explainText="$(string.Explain_ICAClient)">
			<parentCategory ref="CITRIX_COMPONENTS"/>
		</category>
		<category name="ClientDevices" displayName="$(string.ClientDevices)" explainText="$(string.Explain_ClientDevices)">
			<parentCategory ref="ICAClient"/>
		</category>
		<!-- Folder Category for receiver_usb.admx-->
		<category name="GenericUSB" displayName="$(string.GenericUSB)">
			<parentCategory ref="ClientDevices"/>
		</category>
		<category name="AutoUpdate" displayName="$(string.Dir_AutoUpdate)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="Storefront" displayName="$(string.Storefront)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="Network" displayName="$(string.Network)" explainText="$(string.Explain_Network)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="Proxy" displayName="$(string.Proxy)" explainText="$(string.Explain_Proxy)">
			<parentCategory ref="Network"/>
		</category>
		<category name="AdvancePreferencesOptions" displayName="$(string.AdvancePreferencesOptions)" explainText="$(string.Explain_AdvancePreferencesOptions)">
			<parentCategory ref="SelfService"/>
		</category>
		<category name="Authentication" displayName="$(string.Authentication)" explainText="$(string.Explain_Authentication)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="UserExperience" displayName="$(string.UserExperience)" explainText="$(string.Explain_UserExperience)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="ClientEngine" displayName="$(string.ClientEngine)" explainText="$(string.Explain_ClientEngine)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="MultiStreamICA" displayName="$(string.MultiStreamICA)" explainText="$(string.Explain_MultiStreamICA)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="CEIP" displayName="$(string.CEIP)" explainText="$(string.Explain_CEIP)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="DPI" displayName="$(string.DPI)" explainText="$(string.Explain_DPI)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="AlwaysOn" displayName="$(string.AlwaysOn)" explainText="$(string.Explain_AlwaysOn)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="FedRAMP" displayName="$(string.FedRAMP)" explainText="$(string.Explain_FedRAMP)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="SelfService" displayName="$(string.SelfService)" explainText="$(string.Explain_SelfService)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="Fast_Connect_API_Support" displayName="$(string.Fast_Connect_API_Support)" explainText="$(string.Explain_FastConnect)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="CitrixSecureBrowser" displayName="$(string.CitrixSecureBrowser)" explainText="$(string.Explain_CitrixSecureBrowser)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="GlobalAppConfig" displayName="$(string.GlobalAppConfig)" explainText="$(string.Explain_GlobalAppConfig)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="AppProtection" displayName="$(string.AppProtection)" explainText="$(string.Explain_AppProtection)">
			<parentCategory ref="ICAClient"/>
		</category>
		<category name="AntiDLLInjection" displayName="$(string.AntiDLLInjection)" explainText="$(string.Explain_AntiDLLInjection)">
			<parentCategory ref="AppProtection"/>
		</category>
		<category name="CitrixEnterpriseBrowser" displayName="$(string.CitrixEnterpriseBrowser)" explainText="$(string.Explain_CitrixEnterpriseBrowser)">
			<parentCategory ref="ICAClient"/>
		</category>
	</categories>
	<policies>
		<policy name="Policy_EnableICAClient" class="Machine" displayName="$(string.Policy_EnableICAClient)" explainText="$(string.Explain_EnableICAClient)" presentation="$(presentation.Policy_EnableICAClient)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions">
			<parentCategory ref="ICAClient"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<elements>
				<boolean id="Part_EnableICAClient_Enable" valueName="AllowConnection">
					<trueValue>
						<decimal value="1"/>
					</trueValue>
					<falseValue>
						<decimal value="0"/>
					</falseValue>
				</boolean>
				<decimal id="Part_EnableICAClient_Minimum" valueName="Version Minimum" minValue="10000" maxValue="100000" storeAsText="true"/>
			</elements>
		</policy>
		<policy name="Policy_ExtraURLProtocols" class="Machine" displayName="$(string.Policy_ExtraURLProtocols)" explainText="$(string.Explain_ExtraURLProtocols)" presentation="$(presentation.Policy_ExtraURLProtocols)" key="Software\Policies\Citrix\ICA Client\SFTA">
			<parentCategory ref="ICAClient"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<elements>
				<text id="Part_ExtraURLProtocols" valueName="ExtraURLProtocols"/>
			</elements>
		</policy>
		<policy name="Storefronts" class="Machine" displayName="$(string.Storefronts)" explainText="$(string.Storefronts_Help)" presentation="$(presentation.Storefronts)" key="Software\Policies\Citrix\Receiver\Sites">
			<parentCategory ref="Storefront"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<list id="Storefronts_Part" key="Software\Policies\Citrix\Receiver\Sites" valuePrefix="STORE" additive="true"/>
			</elements>
		</policy>
		<policy name="Storefronts_TrustedAccounts" class="Machine" displayName="$(string.Storefronts_TrustedAccounts)" explainText="$(string.Storefronts_TrustedAccounts_Help)" presentation="$(presentation.Storefronts_TrustedAccounts)" key="Software\Policies\Citrix\Receiver\TrustedAccounts">
			<parentCategory ref="Storefront"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<list id="Storefronts_TrustedAccounts_Part" key="Software\Policies\Citrix\Receiver\TrustedAccounts" valuePrefix="STORE" additive="true"/>
			</elements>
		</policy>
		<policy name="Policy_SSLLockdown" class="Machine" displayName="$(string.Policy_SSLLockdown)" explainText="$(string.Explain_SSLLockdown)" presentation="$(presentation.Policy_SSLLockdown)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\SSL">
			<parentCategory ref="Network"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_SSL_EnabledLockdown" valueName="SSLEnable">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>*</string>
					</falseValue>
				</boolean>
				<enum id="Part_SSL_SecurityComplianceMode" valueName="SSLSecurityComplianceMode">
					<item displayName="$(string.unknown_1187)">
						<value>
							<string>NONE</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1191)">
						<value>
							<string>SP800-52</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1189)">
						<value>
							<string>FIPS</string>
						</value>
					</item>
				</enum>
				<text id="Part_SSL_SSLProxyHostLockdown" valueName="SSLProxyHost"/>
				<enum id="Part_SSL_SSLProtocolLockdown" valueName="SecureChannelProtocol">
					<item displayName="$(string.unknown_1203)">
						<value>
							<string>TLS12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1205)">
						<value>
							<string>TLS11_TLS12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1207)">
						<value>
							<string>TLS11_TLS12_TLS13</string>
						</value>
					</item>
				</enum>
				<enum id="Part_SSL_CiphersetLockdown" valueName="SSLCiphers">
					<item displayName="$(string.unknown_1201)">
						<value>
							<string>
              </string>
						</value>
					</item>
					<item displayName="$(string.unknown_26)">
						<value>
							<string>GOV</string>
						</value>
					</item>
					<item displayName="$(string.unknown_28)">
						<value>
							<string>COM</string>
						</value>
					</item>
				</enum>
				<enum id="Part_SSL_RevocationLockdown" valueName="SSLCertificateRevocationCheckPolicy">
					<item displayName="$(string.unknown_638)">
						<value>
							<string>NoCheck</string>
						</value>
					</item>
					<item displayName="$(string.unknown_640)">
						<value>
							<string>CheckNoNetworkAccess</string>
						</value>
					</item>
					<item displayName="$(string.unknown_642)">
						<value>
							<string>FullAccessCheck</string>
						</value>
					</item>
					<item displayName="$(string.unknown_644)">
						<value>
							<string>FullAccessCheckAndCrlRequired</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1209)">
						<value>
							<string>FullAccessCheckAndCrlRequiredAll</string>
						</value>
					</item>
				</enum>
				<text id="Part_SSL_SSLPolicyOID" valueName="SSLPolicyExtensionOID"/>
				<enum id="Part_SSL_ClientAuthentication" valueName="SSLClientAuthentication">
					<item displayName="$(string.unknown_40)">
						<value>
							<string>
              </string>
						</value>
					</item>
					<item displayName="$(string.unknown_42)">
						<value>
							<string>AlwaysPromptUser</string>
						</value>
					</item>
					<item displayName="$(string.unknown_44)">
						<value>
							<string>Off</string>
						</value>
					</item>
					<item displayName="$(string.unknown_46)">
						<value>
							<string>On</string>
						</value>
					</item>
					<item displayName="$(string.unknown_48)">
						<value>
							<string>PromptUser</string>
						</value>
					</item>
				</enum>
				<text id="Part_SSL_ClientCertificate" valueName="SSLClientCertificate"/>
			</elements>
		</policy>
		<policy name="Policy_ConfigureClientSelectiveTrust" class="Machine" displayName="$(string.Policy_ConfigureClientSelectiveTrust)" explainText="$(string.Explain_ConfigureClientSelectiveTrust)" presentation="$(presentation.Policy_ConfigureClientSelectiveTrust)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\ClientSelectiveTrust">
			<parentCategory ref="Network"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_EnableClientSelectiveTrust" valueName="EnableClientSelectiveTrust">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>*</string>
					</falseValue>
				</boolean>
				<text id="Part_ConfigureClientSelectiveTrust_IEZone" key="SOFTWARE\Citrix\ICA Client\Engine\Configuration\Region Identification\Trusted Region\Evidence" valueName="InternetExplorerZone"/>
				<text id="Part_ConfigureClientSelectiveTrust_EffectiveAddress" key="SOFTWARE\Citrix\ICA Client\Engine\Configuration\Region Identification\Trusted Region\Evidence" valueName="EffectiveAddress"/>
			</elements>
		</policy>
		<policy name="Policy_ClientAutoReconnect" class="Machine" displayName="$(string.Policy_ClientAutoReconnect)" explainText="$(string.Explain_ClientAutoReconnect)" presentation="$(presentation.Policy_ClientAutoReconnect)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Reconnection">
			<parentCategory ref="Network"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_ClientAutoReconnect_Reconnect" valueName="TransportReconnectEnabled">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_ClientAutoReconnect_CGP" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\CGP" valueName="CGPAddress">
					<trueValue>
						<string>
            </string>
					</trueValue>
					<falseValue>
						<string>0.0.0.0</string>
					</falseValue>
				</boolean>
				<decimal id="Part_ClientAutoReconnect_Dimming" storeAsText="true" valueName="NetDisruptBrightness" minValue="0" maxValue="100"/>
			</elements>
		</policy>
		<policy name="Policy_TransportProtocal" class="Machine" displayName="$(string.Policy_TransportProtocal)" explainText="$(string.Explain_TransportProtocal)" presentation="$(presentation.Policy_HDXoverUDP)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\UDT">
			<parentCategory ref="Network"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="refid_HDXoverUDP" valueName="HDXoverUDP">
					<item displayName="$(string.HDXoverUDP_Off)">
						<value>
							<string>Off</string>
						</value>
					</item>
					<item displayName="$(string.HDXoverUDP_Preferred)">
						<value>
							<string>Preferred</string>
						</value>
					</item>
					<item displayName="$(string.HDXoverUDP_On)">
						<value>
							<string>On</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_ProxyLockdown" class="Machine" displayName="$(string.Policy_ProxyLockdown)" explainText="$(string.Explain_ProxyLockdown)" presentation="$(presentation.Policy_ProxyLockdown)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Proxy">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_Proxy_ProxyTypeLockdown" valueName="ProxyType">
					<item displayName="$(string.ProxyType_Auto)">
						<value>
							<string>Auto</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_None)">
						<value>
							<string>None</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKS)">
						<value>
							<string>SOCKS</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKSv4)">
						<value>
							<string>SOCKSv4</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKSv5)">
						<value>
							<string>SOCKSv5</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_Secure)">
						<value>
							<string>Secure</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_Script)">
						<value>
							<string>Script</string>
						</value>
					</item>
				</enum>
				<text id="Part_Proxy_ProxyHostLockdown" valueName="ProxyHost"/>
				<text id="Part_Proxy_ProxyPortLockdown" valueName="ProxyPort"/>
				<text id="Part_Proxy_ProxyAutoConfigUrlLockdown" valueName="ProxyAutoConfigUrl"/>
				<text id="Part_Proxy_ProxyBypassListLockdown" valueName="ProxyBypassList"/>
			</elements>
		</policy>
		<policy name="Policy_AltProxyLockdown" class="Machine" displayName="$(string.Policy_AltProxyLockdown)" explainText="$(string.Explain_AltProxyLockdown)" presentation="$(presentation.Policy_AltProxyLockdown)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Proxy">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_AltProxy_ProxyTypeLockdown" valueName="AltProxyType">
					<item displayName="$(string.ProxyType_Auto)">
						<value>
							<string>Auto</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_None)">
						<value>
							<string>None</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKS)">
						<value>
							<string>SOCKS</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKSv4)">
						<value>
							<string>SOCKSv4</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKSv5)">
						<value>
							<string>SOCKSv5</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_Secure)">
						<value>
							<string>Secure</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_Script)">
						<value>
							<string>Script</string>
						</value>
					</item>
				</enum>
				<text id="Part_AltProxy_ProxyHostLockdown" valueName="AltProxyHost"/>
				<text id="Part_AltProxy_ProxyPortLockdown" valueName="AltProxyPort"/>
				<text id="Part_AltProxy_ProxyAutoConfigUrlLockdown" valueName="AltProxyAutoConfigUrl"/>
				<text id="Part_AltProxy_ProxyBypassListLockdown" valueName="AltProxyBypassList"/>
				<boolean id="Part_AltProxy_ProxyFallbackLockdown" valueName="ProxyFallback">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_ProxySocks" class="Machine" displayName="$(string.Policy_ProxySocks)" explainText="$(string.Explain_ProxySocks)" presentation="$(presentation.Policy_ProxySocks)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Proxy">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_ProxySocks_Version" valueName="ICASOCKSProtocolVersion">
					<item displayName="$(string.unknown_2)">
						<value>
							<string>-1,default</string>
						</value>
					</item>
					<item displayName="$(string.unknown_4)">
						<value>
							<string>0,4,5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_6)">
						<value>
							<string>4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_8)">
						<value>
							<string>5</string>
						</value>
					</item>
				</enum>
				<text id="Part_ProxySocks_ProxyHostLockdown" valueName="ICASOCKSProxyHost"/>
				<text id="Part_ProxySOCKS_ProxyPortLockdown" valueName="ICASOCKSProxyPortNumber"/>
			</elements>
		</policy>
		<policy name="Policy_ProxyAuthentication" class="Machine" displayName="$(string.Policy_ProxyAuthentication)" explainText="$(string.Explain_ProxyAuthentication)" presentation="$(presentation.Policy_ProxyAuthentication)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Proxy">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Policy_ProxyExplicitAuthenticationEnabled" valueName="ProxyAuthenticationPrompt">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Policy_ProxyBasicAuthenticationEnabled" valueName="ProxyAuthenticationBasic">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Policy_ProxyNTLMAuthenticationEnabled" valueName="ProxyAuthenticationNTLM">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<text id="Part_Proxy_Socks5User" valueName="ProxyUsername"/>
				<text id="Part_Proxy_Socks5Password" valueName="ProxyPassword"/>
			</elements>
		</policy>
		<policy name="Policy_Smartcard" class="Machine" displayName="$(string.Policy_Smartcard)" explainText="$(string.Explain_Smartcard)" presentation="$(presentation.Policy_Smartcard)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Smartcard" valueName="SmartCardAllowed">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>*</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<elements>
				<boolean id="Part_Smartcard_Enable" valueName="SmartCardAllowed">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_SmartcardPin_Enable" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Smartcard" valueName="DisableCtrlAltDel">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>*</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_KerberosLockdown" class="Machine" displayName="$(string.Policy_KerberosLockdown)" explainText="$(string.Explain_KerberosLockdown)" presentation="$(presentation.Policy_KerberosLockdown)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Kerberos" valueName="SSPIEnabled">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="SSOnUserSetting">
					<value>
						<string>true,false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableSSOnThruICAFile">
					<value>
						<string>true</string>
					</value>
				</item>
				<item key="Software\Citrix\ICA Client" valueName="SSPIEnabled">
					<value>
						<decimal value="1"/>
					</value>
				</item>
			</enabledList>
		</policy>
		<policy name="Policy_SSONForNSG" class="Machine" displayName="$(string.Policy_SSONForNSG)" explainText="$(string.Explain_SSONForNSG)" presentation="$(presentation.Policy_SSONForNSG)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\NSGSSON" valueName="Enabled">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableRCG" class="Machine" displayName="$(string.Policy_EnableRCG)" explainText="$(string.Explain_EnableRCG)" presentation="$(presentation.Policy_EnableRCG)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableRCG">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_DisablePersistentCookies" class="Machine" displayName="$(string.Policy_DisablePersistentCookies)" explainText="$(string.Explain_DisablePersistentCookies)" presentation="$(presentation.Policy_DisablePersistentCookies)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\PersistentCookies" valueName="Disabled">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_LocalCredentialsLockdown" class="Machine" displayName="$(string.Policy_LocalCredentialsLockdown)" explainText="$(string.Explain_LocalCredentialsLockdown)" presentation="$(presentation.Policy_LocalCredentialsLockdown)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="UseLocalUserAndPassword">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="SSOnUserSetting">
					<value>
						<string>true,false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableSSOnThruICAFile">
					<value>
						<string>true</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\SSON" valueName="Enable">
					<value>
						<string>true</string>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\SSON" valueName="Enable">
					<value>
						<string>false</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<boolean id="Part_LocalCredentialsLockdown_Enable" valueName="UseLocalUserAndPassword">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
					<trueList>
						<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="SSOnUserSetting">
							<value>
								<string>true,false</string>
							</value>
						</item>
						<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableSSOnThruICAFile">
							<value>
								<string>true</string>
							</value>
						</item>
						<item key="Software\Policies\Citrix\ICA Client\SSON" valueName="Enable">
							<value>
								<string>true</string>
							</value>
						</item>
					</trueList>
					<falseList>
						<item key="Software\Policies\Citrix\ICA Client\SSON" valueName="Enable">
							<value>
								<string>false</string>
							</value>
						</item>
						<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="SSOnUserSetting">
							<value>
								<string>false</string>
							</value>
						</item>
						<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableSSOnThruICAFile">
							<value>
								<string>false</string>
							</value>
						</item>
					</falseList>
				</boolean>
				<boolean id="Part_LegacyLocalUserNameAndPassword_Enable" valueName="LegacyLocalUserNameAndPassword">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_NovellCredentials" valueName="SSOnCredentialType">
					<trueValue>
						<string>NDS</string>
					</trueValue>
					<falseValue>
						<string>Any,NT,NDS</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_WITicket" class="Machine" displayName="$(string.Policy_WITicket)" explainText="$(string.Explain_WITicket)" presentation="$(presentation.Policy_WITicket)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Saved Credentials">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_WITicket_Legacy_Enable" valueName="ClearPassword">
					<trueValue>
						<string>
            </string>
					</trueValue>
					<falseValue>
						<string>xxxxxxxxx</string>
					</falseValue>
				</boolean>
				<boolean id="Part_WITicket_LogonTicket_Enable" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Ticket" valueName="LogonTicket">
					<trueValue>
						<string>
            </string>
					</trueValue>
					<falseValue>
						<string>xxxxxxxxx</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_EnableDriveMapping" class="Machine" displayName="$(string.Policy_EnableDriveMapping)" explainText="$(string.Explain_EnableDriveMapping)" presentation="$(presentation.Policy_EnableDriveMapping)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Drives">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_EnableDriveMappingCheckbox" valueName="CDMAllowed">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_EnableDriveMappingReadonly" valueName="CDMReadOnly">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false,true</string>
					</falseValue>
				</boolean>
				<text id="Part_EnableDriveMappingDisableDrives" valueName="DisableDrives"/>
			</elements>
		</policy>
		<policy name="Policy_EnablePrinterMapping" class="Machine" displayName="$(string.Policy_EnablePrinterMapping)" explainText="$(string.Explain_EnablePrinterMapping)" presentation="$(presentation.Policy_EnablePrinterMapping)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Printing" valueName="VSLAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_LocalPort" class="Machine" displayName="$(string.Policy_LocalPort)" explainText="$(string.Explain_LocalPort)" presentation="$(presentation.Policy_LocalPort)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="COMAllowed">
					<value>
						<string>false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="VirtualCOMPortEmulation">
					<value>
						<string>false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="CPMAllowed">
					<value>
						<string>false</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<text id="Part_MaxPort" valueName="MaxPort"/>
				<boolean id="Part_EnableSerialPortCheckbox" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="COMAllowed">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_EnableVirtualSerialPortCheckbox" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="VirtualCOMPortEmulation">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_EnableParallelPortCheckbox" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Printing" valueName="CPMAllowed">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_ImageCapture" class="Machine" displayName="$(string.Policy_ImageCapture)" explainText="$(string.Explain_ImageCapture)" presentation="$(presentation.Policy_ImageCapture)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Image Capture" valueName="TWAINAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_AudioInput" class="Machine" displayName="$(string.Policy_AudioInput)" explainText="$(string.Explain_AudioInput)" presentation="$(presentation.Policy_AudioInput)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Audio" valueName="EnableAudioInput">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<elements>
				<boolean id="Part_BiDiAudio_Enable" valueName="EnableAudioInput">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Clipboard" class="Machine" displayName="$(string.Policy_Clipboard)" explainText="$(string.Explain_Clipboard)" presentation="$(presentation.Policy_Clipboard)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Clipboard" valueName="ClipboardAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_DragDrop" class="Machine" displayName="$(string.Policy_DragDrop)" explainText="$(string.Explain_DragDrop)" presentation="$(presentation.Policy_DragDrop)" key="Software\Policies\Citrix\ICA Client" valueName="DragDropAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_USB_PNP_Devices" class="Machine" displayName="$(string.Policy_USB_PNP_Devices)" explainText="$(string.Explain_USB_PNP_Devices)" presentation="$(presentation.Policy_USB_PNP_Devices)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\DVC_PlugAndPlay" valueName="PNPDeviceAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_PointOfSales" class="Machine" displayName="$(string.Policy_PointOfSales)" explainText="$(string.Explain_PointOfSales)" presentation="$(presentation.Policy_PointOfSales)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\DVC_PlugAndPlay" valueName="POSDeviceAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_Foreground_Progress_Bar" class="Machine" displayName="$(string.Policy_Foreground_Progress_Bar)" explainText="$(string.Explain_Foreground_Progress_Bar)" presentation="$(presentation.Policy_Foreground_Progress_Bar)" key="Software\Policies\Citrix\ICA Client" valueName="ForegroundProgressBar">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
		</policy>
		<policy name="Policy_HWacceleration" class="Machine" displayName="$(string.Policy_HWacceleration)" explainText="$(string.Explain_HWacceleration)" presentation="$(presentation.Policy_HWacceleration)" key="Software\Policies\Citrix\ICA Client\Graphics Engine" valueName="HWacceleration">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableH265" class="Machine" displayName="$(string.Policy_EnableH265)" explainText="$(string.Explain_EnableH265)" presentation="$(presentation.Policy_EnableH265)" key="Software\Policies\Citrix\ICA Client\Graphics Engine" valueName="EnableH265">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_Audio" class="Machine" displayName="$(string.Policy_Audio)" explainText="$(string.Explain_Audio)" presentation="$(presentation.Policy_Audio)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Audio">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_Audio_Enabled" valueName="ClientAudio">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<enum id="Part_Audio_Quality" valueName="AudioBandwidthLimit">
					<item displayName="$(string.unknown_112)">
						<value>
							<string>0-</string>
						</value>
					</item>
					<item displayName="$(string.unknown_114)">
						<value>
							<string>1-</string>
						</value>
					</item>
					<item displayName="$(string.unknown_116)">
						<value>
							<string>2-</string>
						</value>
					</item>
				</enum>
				<boolean id="Part_RealtimeTransport_Enabled" valueName="EnableRtpAudio">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<decimal id="Part_RtpAudioLowestPort" valueName="RtpAudioLowestPort" minValue="16384" maxValue="65535" storeAsText="true"/>
				<decimal id="Part_RtpAudioHighestPort" valueName="RtpAudioHighestPort" minValue="16384" maxValue="65535" storeAsText="true"/>
				<boolean id="Part_RealtimeTransportThroughGateway_Enabled" valueName="EnableUDPThroughGateway">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Graphics" class="Machine" displayName="$(string.Policy_Graphics)" explainText="$(string.Explain_Graphics)" presentation="$(presentation.Policy_Graphics)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Thinwire Graphics">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_Graphics_ColorDepth" valueName="DesiredColor">
					<item displayName="$(string.unknown_122)">
						<value>
							<string>4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_124)">
						<value>
							<string>8</string>
						</value>
					</item>
				</enum>
				<boolean id="Part_Graphics_DiskCache" valueName="PersistentCacheEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_ImageAcceleration" valueName="SpeedScreenIA">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_SpeedScreenBrowser" valueName="SpeedScreenBA">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_SpeedScreenBrowserCompression" valueName="SpeedScreenBACompressionEnabled">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_SpeedScreenMultimedia" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Multimedia" valueName="SpeedScreenMMA">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_ZeroLatencyKeyboard" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Zero Latency" valueName="ZLKeyboardMode">
					<trueValue>
						<string>2,1,0</string>
					</trueValue>
					<falseValue>
						<string>0</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_ZeroLatencyMouse" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Zero Latency" valueName="ZLMouseMode">
					<trueValue>
						<string>2,1,0</string>
					</trueValue>
					<falseValue>
						<string>0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Display" class="Machine" displayName="$(string.Policy_Display)" explainText="$(string.Explain_Display)" presentation="$(presentation.Policy_Display)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Thinwire Graphics">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<text id="Part_Display_Seamless" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Seamless Windows" valueName="TWIMode"/>
				<text id="Part_Display_Width" valueName="DesiredHRES"/>
				<text id="Part_Display_Height" valueName="DesiredVRES"/>
				<enum id="Part_Display_Percent" valueName="ScreenPercent">
					<item displayName="$(string.unknown_140)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.unknown_142)">
						<value>
							<string>50</string>
						</value>
					</item>
					<item displayName="$(string.unknown_144)">
						<value>
							<string>75</string>
						</value>
					</item>
					<item displayName="$(string.unknown_146)">
						<value>
							<string>
              </string>
						</value>
					</item>
				</enum>
				<text id="Part_Display_WorkArea" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Seamless Windows" valueName="TWIShrinkWorkArea"/>
				<boolean id="Part_Display_FullScreen" valueName="TWIFullScreenMode">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>*</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_DPI" class="Machine" displayName="$(string.Policy_Dpi)" explainText="$(string.Explain_Policy_Dpi)" presentation="$(presentation.Policy_Dpi)" key="Software\Policies\Citrix\ICA Client\DPI">
			<parentCategory ref="DPI"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\DPI" valueName="DpiAware">
					<value>
						<delete/>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\DPI" valueName="DpiAware">
					<value>
						<decimal value="2"/>
					</value>
				</item>
			</disabledList>
			<elements>
				<enum id="scaling_option" valueName="Enable_DPI">
					<item displayName="$(string.yes)">
						<value>
							<decimal value="1"/>
						</value>
					</item>
					<item displayName="$(string.no)">
						<value>
							<decimal value="0"/>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_LocalAppAccess" class="Machine" displayName="$(string.Policy_LocalAppAccess)" explainText="$(string.Explain_LocalAppAccess)" presentation="$(presentation.Policy_LocalAppAccess)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Control" valueName="ClientHostedAppsShortcuts">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Control" valueName="ClientHostedApps">
					<value>
						<string>*</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Seamless Windows" valueName="RTWIMode">
					<value>
						<string>*</string>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Control" valueName="ClientHostedApps">
					<value>
						<string>false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Seamless Windows" valueName="RTWIMode">
					<value>
						<string>false</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<boolean id="Part_Allow_URLRedirection" valueName="ClientHostedAppsURLEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Keyboard_Hotkeys" class="Machine" displayName="$(string.Policy_Keyboard_Hotkeys)" explainText="$(string.Explain_Keyboard_Hotkeys)" presentation="$(presentation.Policy_Keyboard_Hotkeys)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\Hot Keys">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_Keyboard_Hotkey_Tasklist" valueName="HotKey1Shift">
					<item displayName="$(string.unknown_164)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_166)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_168)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_170)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Tasklist_Plus" valueName="HotKey1Char">
					<item displayName="$(string.unknown_172)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_174)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_176)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_178)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_180)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_182)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_184)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_186)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_188)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_190)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_192)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_194)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_196)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_198)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_200)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_202)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_204)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Close_Remote_Application" valueName="HotKey2Shift">
					<item displayName="$(string.unknown_206)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_208)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_210)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_212)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Close_Remote_Application_Plus" valueName="HotKey2Char">
					<item displayName="$(string.unknown_214)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_216)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_218)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_220)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_222)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_224)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_226)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_228)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_230)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_232)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_234)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_236)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_238)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_240)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_242)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_244)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_246)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_Title_Bar" valueName="HotKey3Shift">
					<item displayName="$(string.unknown_248)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_250)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_252)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_254)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_Title_Bar_Plus" valueName="HotKey3Char">
					<item displayName="$(string.unknown_256)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_258)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_260)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_262)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_264)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_266)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_268)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_270)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_272)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_274)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_276)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_278)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_280)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_282)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_284)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_286)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_288)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Alt_Del" valueName="HotKey4Shift">
					<item displayName="$(string.unknown_290)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_292)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_294)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_296)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Alt_Del_Plus" valueName="HotKey4Char">
					<item displayName="$(string.unknown_298)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_300)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_302)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_304)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_306)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_308)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_310)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_312)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_314)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_316)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_318)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_320)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_322)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_324)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_326)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_328)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_330)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Shift_Esc" valueName="HotKey9Shift">
					<item displayName="$(string.unknown_332)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_334)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_336)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_338)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Shift_Esc_Plus" valueName="HotKey9Char">
					<item displayName="$(string.unknown_340)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_342)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_344)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_346)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_348)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_350)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_352)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_354)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_356)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_358)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_360)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_362)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_364)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_366)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_368)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_370)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_372)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Alt_Tab" valueName="HotKey7Shift">
					<item displayName="$(string.unknown_374)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_376)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_378)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_380)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Alt_Tab_Plus" valueName="HotKey7Char">
					<item displayName="$(string.unknown_382)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_384)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_386)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_388)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_390)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_392)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_394)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_396)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_398)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_400)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_402)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_404)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_406)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_408)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_410)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_412)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_414)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Alt_Backtab" valueName="HotKey8Shift">
					<item displayName="$(string.unknown_416)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_418)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_420)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_422)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Alt_Backtab_Plus" valueName="HotKey8Char">
					<item displayName="$(string.unknown_424)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_426)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_428)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_430)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_432)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_434)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_436)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_438)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_440)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_442)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_444)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_446)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_448)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_450)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_452)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_454)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_456)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Esc" valueName="HotKey5Shift">
					<item displayName="$(string.unknown_458)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_460)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_462)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_464)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Esc_Plus" valueName="HotKey5Char">
					<item displayName="$(string.unknown_466)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_468)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_470)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_472)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_474)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_476)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_478)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_480)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_482)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_484)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_486)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_488)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_490)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_492)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_494)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_496)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_498)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Alt" valueName="HotKey6Shift">
					<item displayName="$(string.unknown_500)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_502)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_504)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_506)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Alt_Plus" valueName="HotKey6Char">
					<item displayName="$(string.unknown_508)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_510)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_512)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_514)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_516)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_518)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_520)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_522)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_524)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_526)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_528)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_530)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_532)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_534)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_536)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_538)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_540)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_Latency_Reduction" valueName="HotKey10Shift">
					<item displayName="$(string.unknown_542)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_544)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_546)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_548)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_Latency_Reduction_Plus" valueName="HotKey10Char">
					<item displayName="$(string.unknown_550)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_552)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_554)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_556)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_558)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_560)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_562)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_564)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_566)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_568)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_570)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_572)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_574)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_576)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_578)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_580)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_582)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_LOCALIME" valueName="HotKey14Shift">
					<item displayName="$(string.unknown_688)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_690)">
						<value>
							<string>Alt</string>
						</value>
					</item>
					<item displayName="$(string.unknown_692)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_694)">
						<value>
							<string>Shift</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_LOCALIME_Plus" valueName="HotKey14Char">
					<item displayName="$(string.unknown_696)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_698)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_700)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_702)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_704)">
						<value>
							<string>F12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_706)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_708)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_710)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_712)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_714)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_716)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_718)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_720)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_722)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_724)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_726)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_728)">
						<value>
							<string>tab</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Windows_Key" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Keyboard" valueName="TransparentKeyPassthrough">
					<item displayName="$(string.unknown_158)">
						<value>
							<string>Local</string>
						</value>
					</item>
					<item displayName="$(string.unknown_160)">
						<value>
							<string>Remote</string>
						</value>
					</item>
					<item displayName="$(string.unknown_162)">
						<value>
							<string>FullScreenOnly</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Keyboard_Settings" class="Machine" displayName="$(string.Policy_Keyboard_Settings)" explainText="$(string.Explain_Keyboard_Settings)" presentation="$(presentation.Policy_Keyboard_Settings)" key="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Keyboard">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledList defaultKey="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\GPO Disable\Keyboard">
				<item valueName="LocalIME">
					<value>
						<delete/>
					</value>
				</item>
				<item valueName="KeyboardSyncMode">
					<value>
						<delete/>
					</value>
				</item>
			</enabledList>
			<disabledList defaultKey="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\GPO Disable\Keyboard">
				<item valueName="LocalIME">
					<value>
						<string>0</string>
					</value>
				</item>
				<item valueName="KeyboardSyncMode">
					<value>
						<string>(User Profile)</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<enum id="Always_Sync_Keyboard_Layout" valueName="LocalIME">
					<item displayName="$(string.no_always_sync_keyboard_layout)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.yes_always_sync_keyboard_layout)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<enum id="Sync_Keyboard_Layout_Once" valueName="KeyboardSyncMode">
					<item displayName="$(string.sync_current_keyboard_layout_once)">
						<value>
							<string>(User Profile)</string>
						</value>
					</item>
					<item displayName="$(string.not_sync_keyboard_layout_once)">
						<value>
							<string>(Server Default)</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_IME_Settings" class="Machine" displayName="$(string.Policy_IME_Settings)" explainText="$(string.Explain_IME_Settings)" presentation="$(presentation.Policy_IME_Settings)" key="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Keyboard">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledList defaultKey="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\GPO Disable\Keyboard">
				<item valueName="DisableLanguageBar">
					<value>
						<delete/>
					</value>
				</item>
			</enabledList>
			<disabledList defaultKey="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\GPO Disable\Keyboard">
				<item valueName="DisableLanguageBar">
					<value>
						<string>0</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<enum id="Display_language_bar" valueName="DisableLanguageBar">
					<item displayName="$(string.yes)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.no_hide_language_bar)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_PublishedApplications" class="Machine" displayName="$(string.Policy_PublishedApplications)" explainText="$(string.Explain_PublishedApplications)" presentation="$(presentation.Policy_PublishedApplications)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\Application Launching">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<elements>
				<text id="Part_PublishedApplications_InitialProgram" valueName="InitialProgram"/>
				<boolean id="Part_PublishedApplications_SessionSharing" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\Session Sharing" valueName="EnableSessionSharing">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_HostRenderedAudio" class="Machine" displayName="$(string.Policy_HostRenderedAudio)" explainText="$(string.Explain_HostRenderedAudio)" presentation="$(presentation.Policy_HostRenderedAudio)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Audio" valueName="HostRenderedAudio">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_BidirectionalContentRedirection" class="User" displayName="$(string.Policy_BidirectionalContentRedirection)" explainText="$(string.Explain_BidirectionalContentRedirection)" presentation="$(presentation.Policy_BidirectionalContentRedirection)" key="Software\Policies\Citrix\ICA Client\Bidirectional Content Redirection" valueName="AllowBidirectionalContentRedirection">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
			<elements>
				<text id="Part_BidirectionalContentRedirectionPubAppOrDesktopName" valueName="PublishedAppOrDesktopName" required="true"/>
				<enum id="Part_BidirectionalContentRedirectionPubNameType" valueName="PublishedAppOrDesktopNameType" required="true">
					<item displayName="$(string.Part_BidirectionalContentRedirectionApplication)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.Part_BidirectionalContentRedirectionDesktop)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="Part_BidirectionalContentRedirectionVDAURLs" valueName="VDAURLs"/>
				<text id="Part_BidirectionalContentRedirectionClientURLs" valueName="ClientURLs"/>
			</elements>
		</policy>
		<policy name="Policy_BidirectionalContentRedirectionOverrides" class="User" displayName="$(string.Policy_BidirectionalContentRedirectionOverrides)" explainText="$(string.Explain_BidirectionalContentRedirectionOverrides)" presentation="$(presentation.Policy_BidirectionalContentRedirectionOverrides)" key="Software\Policies\Citrix\ICA Client\Bidirectional Content Redirection" valueName="VDAAppOverridesEnabled">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
			<elements>
				<list id="Part_BidirectionalContentRedirectionVDAAppOverrides" key="Software\Policies\Citrix\ICA Client\Bidirectional Content Redirection\VDAAppOverrides" explicitValue="true"/>
			</elements>
		</policy>
		<policy name="Policy_OAuthRedirection" class="User" displayName="$(string.Policy_OAuthRedirection)" explainText="$(string.Explain_OAuthRedirection)" presentation="$(presentation.Policy_OAuthRedirection)" key="Software\Policies\Citrix\ICA Client\OAuth Redirection" valueName="AllowOAuthRedirection">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
			<enabledList>
				<item key="Software\Classes\citrix-oauth-redir" valueName="">
					<value>
						<string>URL:Citrix OAuth2 Redirection Helper</string>
					</value>
				</item>
				<item key="Software\Classes\citrix-oauth-redir" valueName="URL Protocol">
					<value>
						<string>
            </string>
					</value>
				</item>
				<item key="Software\Classes\citrix-oauth-redir\shell\open\command" valueName="">
					<value>
						<string>"c:\Program Files (x86)\Citrix\ICA Client\redirector.exe" /launch "%1"</string>
					</value>
				</item>
			</enabledList>
			<elements>
				<text id="Part_OAuthRedirectionRedirectionPattern" valueName="Pattern"/>
				<text id="Part_OAuthRedirectionScheme" valueName="Scheme"/>
			</elements>
		</policy>
		<policy name="Policy_ICAFileSettings" class="Machine" displayName="$(string.Policy_ICAFileSettings)" explainText="$(string.Explain_ICAFileSettings)" presentation="$(presentation.Policy_ICAFileSettings)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\ICA File">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_ICAFileSettings_RemoveICAFile" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\ICA File" valueName="RemoveICAFile">
					<trueValue>
						<string>True</string>
					</trueValue>
					<falseValue>
						<string>False</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_MSISettings" class="Machine" displayName="$(string.Policy_MSISettings)" explainText="$(string.Explain_MSISettings)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Multi-Stream" valueName="MSIEnabled">
			<parentCategory ref="MultiStreamICA"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>True</string>
			</enabledValue>
			<disabledValue>
				<string>False</string>
			</disabledValue>
		</policy>
		<policy name="Policy_EngineErrMsg" class="Machine" displayName="$(string.Policy_EngineErrMsg)" explainText="$(string.Explain_EnableEngineErrMsg)" presentation="$(presentation.Policy_EngineErrMsg)" key="Software\Policies\Citrix\ICA Client\Engine" valueName="Enable_EngineErrMsg">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Polciy_CEIP" class="Machine" displayName="$(string.Polciy_CEIP)" explainText="$(string.Explain_EnableCEIP)" presentation="$(presentation.Polciy_CEIP)" key="Software\Policies\Citrix\ICA Client\CEIP" valueName="Enable_CEIP">
			<parentCategory ref="CEIP"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Polciy_CEIP_Configuration" class="Machine" displayName="$(string.Polciy_CEIP_Configuration)" explainText="$(string.Explain_CEIP_Configuration)" presentation="$(presentation.Polciy_CEIP_Configuration)" key="Software\Policies\Citrix\ICA Client\CEIP">
			<parentCategory ref="CEIP"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<text id="Part_CEIP_ServerURL" valueName="CEIP_ServerURL"/>
				<text id="Part_CEIP_UploadClass" valueName="CEIP_UploadClass"/>
				<decimal id="Part_CEIP_UploadFrequencyInWeeks" valueName="CEIP_UploadFrequencyInWeeks" minValue="1" maxValue="7"/>
				<boolean id="Part_AllowUnSecureURL" valueName="AllowUnSecureURL">
					<trueValue>
						<decimal value="1"/>
					</trueValue>
					<falseValue>
						<decimal value="0"/>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_AlwaysOn" class="Machine" displayName="$(string.Policy_AlwaysOn)" explainText="$(string.Explain_EnableAlwaysOn)" presentation="$(presentation.Policy_AlwaysOn)" key="Software\Policies\Citrix\ICA Client\AoLog" valueName="EnableTracing">
			<parentCategory ref="AlwaysOn"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_FedRAMP" class="Machine" displayName="$(string.Policy_FedRAMP)" explainText="$(string.Explain_FedRAMP)" presentation="$(presentation.Policy_FedRAMP)" key="Software\Policies\Citrix\ICA Client\Compliance\Disable3rdPartyData" valueName="DisableSend">
			<parentCategory ref="FedRAMP"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableFTU" class="Machine" displayName="$(string.Policy_EnableFTU)" explainText="$(string.Explain_EnableFTU)" presentation="$(presentation.Policy_EnableFTU)" key="SOFTWARE\Policies\Citrix" valueName="EnableX1FTU">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableSilentAuthForCloudStore" class="Machine" displayName="$(string.Policy_EnableSilentAuthForCloudStore)" explainText="$(string.Explain_EnableSilentAuthForCloudStore)" presentation="$(presentation.Policy_EnableSilentAuthForCloudStore)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="EnableSilentAuthForCloudStore">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableQuickDesktopLaunch" class="Machine" displayName="$(string.Policy_EnableQuickDesktopLaunch)" explainText="$(string.Explain_EnableQuickDesktopLaunch)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="QuickDesktopLaunchSupport">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableEmptyInitialProgramLaunchRestriction" class="Machine" displayName="$(string.Policy_EnableEmptyInitialProgramLaunchRestriction)" explainText="$(string.Explain_EnableEmptyInitialProgramLaunchRestriction)" presentation="$(presentation.Policy_EnableEmptyInitialProgramLaunchRestriction)" key="SOFTWARE\Policies\Citrix" valueName="EmptyInitialProgramLaunchRestrictionEnabled">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableEmptyInitialProgramLaunchRestriction_1" class="User" displayName="$(string.Policy_EnableEmptyInitialProgramLaunchRestriction)" explainText="$(string.Explain_EnableEmptyInitialProgramLaunchRestriction)" presentation="$(presentation.Policy_EnableEmptyInitialProgramLaunchRestriction)" key="SOFTWARE\Policies\Citrix" valueName="EmptyInitialProgramLaunchRestrictionEnabled">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_BlockDirectICAFileLaunches" class="Machine" displayName="$(string.Policy_BlockDirectICAFileLaunches)" explainText="$(string.Explain_BlockDirectICAFileLaunches)" presentation="$(presentation.Policy_BlockDirectICAFileLaunches)" key="SOFTWARE\Policies\Citrix" valueName="BlockDirectICAFileLaunches">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_BlockDirectICAFileLaunches_1" class="User" displayName="$(string.Policy_BlockDirectICAFileLaunches)" explainText="$(string.Explain_BlockDirectICAFileLaunches)" presentation="$(presentation.Policy_BlockDirectICAFileLaunches)" key="SOFTWARE\Policies\Citrix" valueName="BlockDirectICAFileLaunches">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableNPS" class="User" displayName="$(string.Policy_EnableNPS)" explainText="$(string.Explain_EnableNPS)" presentation="$(presentation.Policy_EnableNPS)" key="SOFTWARE\Policies\Citrix" valueName="EnableNPS">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideConfigChecker" class="Machine" displayName="$(string.Policy_HideConfigChecker)" explainText="$(string.Explain_HideConfigChecker)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="DisableConfigChecker">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideSupportInfo" class="Machine" displayName="$(string.Policy_HideSupportInfo)" explainText="$(string.Explain_HideConfigChecker)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideSupportInfo">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideDeletePassword" class="Machine" displayName="$(string.Policy_HideDeletePassword)" explainText="$(string.Explain_HideDeletePassword)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideDeletePassword">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideDataCollection" class="Machine" displayName="$(string.Policy_HideDataCollection)" explainText="$(string.Explain_HideDataCollection)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideDataCollection">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideLocalKeyboardLayoutSetting" class="Machine" displayName="$(string.Policy_HideLocalKeyboardLayoutSetting)" explainText="$(string.Explain_HideLocalKeyboardLayoutSetting)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideLocalKeyboardLayoutSetting">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideDPIsettings" class="Machine" displayName="$(string.Policy_HideDPIsettings)" explainText="$(string.Explain_HideDPIsettings)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideDPIsettings">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideConnectionCenter" class="Machine" displayName="$(string.Policy_HideConnectionCenter)" explainText="$(string.Explain_HideConnectionCenter)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideConnectionCenter">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideAdvancedPreferences" class="Machine" displayName="$(string.Policy_HideAdvancedPreferences)" explainText="$(string.Explain_HideAdvancedPreferences)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideAdvancedPreferences">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideCitrixFiles" class="Machine" displayName="$(string.Policy_HideCitrixFiles)" explainText="$(string.Explain_HideCitrixFiles)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideCitrixFiles">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_HideCitrixCasting" class="Machine" displayName="$(string.Policy_HideCitrixCasting)" explainText="$(string.Explain_HideCitrixCasting)" presentation="$(presentation.Policy_HideAdvancePreferencesOptions)" key="Software\Policies\Citrix" valueName="HideCitrixCasting">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_Vprefer" class="Machine" displayName="$(string.Policy_Vprefer)" explainText="$(string.Explain_Vprefer)" presentation="$(presentation.Policy_Vprefer)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="VPrefer">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
			<elements>
				<enum id="Allowed_Apps" valueName="AllowApps">
					<item displayName="$(string.AllowInstalledApps)">
						<value>
							<decimal value="0"/>
						</value>
					</item>
					<item displayName="$(string.AllowAllApps)">
						<value>
							<decimal value="1"/>
						</value>
					</item>
					<item displayName="$(string.AllowNetworkApps)">
						<value>
							<decimal value="2"/>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_EnableFTA" class="Machine" displayName="$(string.Policy_EnableFTA)" explainText="$(string.Explain_EnableFTA)" presentation="$(presentation.Policy_EnableFTA)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="EnableFTA">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableDefaultFTA" class="Machine" displayName="$(string.Policy_EnableDefaultFTA)" explainText="$(string.Explain_EnableDefaultFTA)" presentation="$(presentation.Policy_EnableDefaultFTA)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="EnabledDefaultFTAs">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_HideSettings" class="Machine" displayName="$(string.Policy_HideSettings)" explainText="$(string.Explain_HideSettings)" presentation="$(presentation.Policy_HideSettings)" key="SOFTWARE\Policies\Citrix" valueName="DisableSettings">
			<parentCategory ref="AdvancePreferencesOptions"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Pick_UI_display" valueName="DisableSettings">
					<item displayName="$(string.unknown_1210)">
						<value>
							<string>1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1211)">
						<value>
							<string>2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1212)">
						<value>
							<string>3</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_SelfServiceMode_Enable" class="Machine" displayName="$(string.Policy_SelfServiceMode_Enable)" explainText="$(string.Explain_SelfServiceMode_Enable)" presentation="$(presentation.Policy_SelfServiceMode_Enable)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="SelfServiceMode">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_PublishSafeContent" class="Machine" displayName="$(string.Policy_PublishSafeContent)" explainText="$(string.Explain_PublishSafeContent)" presentation="$(presentation.Policy_PublishSafeContent)" key="SOFTWARE\Policies\Citrix\Dazzle">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Pick_Publish_SafeContent" valueName="PublishSafeContent">
					<item displayName="$(string.AllowPublishContent)">
						<value>
							<string>true</string>
						</value>
					</item>
					<item displayName="$(string.PreventPublishContent)">
						<value>
							<string>false</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_PublishUnsafeContent" class="Machine" displayName="$(string.Policy_PublishUnsafeContent)" explainText="$(string.Explain_PublishUnsafeContent)" presentation="$(presentation.Policy_PublishUnsafeContent)" key="SOFTWARE\Policies\Citrix\Dazzle">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Pick_Publish_UnsafeContent" valueName="PublishUnsafeContent">
					<item displayName="$(string.AllowPublishContent)">
						<value>
							<string>true</string>
						</value>
					</item>
					<item displayName="$(string.PreventPublishContent)">
						<value>
							<string>false</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_EnableAppShortCut" class="Machine" displayName="$(string.Policy_EnableAppShortCut)" explainText="$(string.Explain_EnableAppShortCut)" presentation="$(presentation.Policy_EnableAppShortCut)" key="SOFTWARE\Policies\Citrix\Dazzle">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<text id="Part_StartMenuDir_Text" valueName="StartMenuDir"/>
				<text id="Part_DesktopDir_Text" valueName="DesktopDir"/>
				<boolean id="Part_StartMenuShortcut_Disable" valueName="PutShortcutsInstartmenu">
					<trueValue>
						<string>false</string>
					</trueValue>
					<falseValue>
						<string>true</string>
					</falseValue>
				</boolean>
				<boolean id="Part_DesktopShortcut_Enable" valueName="PutShortcutsOnDesktop">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_UseCategoryAsStartMenuPath_Disable" valueName="UseCategoryAsStartMenuPath">
					<trueValue>
						<string>false</string>
					</trueValue>
					<falseValue>
						<string>true</string>
					</falseValue>
				</boolean>
				<boolean id="Part_UseCategoryAsDesktopPath_Enable" valueName="UseCategoryAsDesktopPath">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_UseDifferentPathsforStartmenuAndDesktop_Enable" valueName="UseDifferentPathsforStartmenuAndDesktop">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_RemoveAppsOnLogoff_Enable" valueName="RemoveAppsOnLogoff">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_RemoveAppsOnExit_Enable" valueName="RemoveAppsOnExit">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_ClearAppListOnLogoff_Enable" valueName="ClearAppListOnLogoff">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_SuppressRefreshOnStartup_Enable" valueName="SuppressRefreshOnStartup">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_AllAppsAreMandatory_Enable" valueName="AllAppsAreMandatory">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_AddAccounts" class="Machine" displayName="$(string.Policy_AddAccounts)" explainText="$(string.Explain_AddAccount_Enable)" presentation="$(presentation.Policy_AddAccounts)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="HideEditStoresDialog">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>false</string>
			</enabledValue>
			<disabledValue>
				<string>true</string>
			</disabledValue>
		</policy>
		<policy name="Policy_EnablePreLaunch" class="Machine" displayName="$(string.Policy_EnablePreLaunch)" explainText="$(string.Explain_EnablePreLaunch)" presentation="$(presentation.Policy_EnablePreLaunch)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="EnablePreLaunch">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="AppProtectionAdvanced" class="Machine" displayName="$(string.AppProtectionAdvanced)" explainText="$(string.Explain_AppProtectionAdvanced)" presentation="$(presentation.AppProtectionAdvanced)" key="Software\Policies\Citrix\ICA Client" valueName="AppProtectionAdvanced">
			<parentCategory ref="ICAClient"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_ReconnectMode" class="Machine" displayName="$(string.Policy_ReconnectMode)" explainText="$(string.Explain_Policy_ReconnectMode)" presentation="$(presentation.Policy_ReconnectMode)" key="SOFTWARE\Policies\Citrix\Dazzle">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Pick_ReconnectMode" valueName="WSCReconnectMode">
					<item displayName="$(string.unknown_656)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.unknown_658)">
						<value>
							<string>1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_660)">
						<value>
							<string>2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_662)">
						<value>
							<string>3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_664)">
						<value>
							<string>4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_666)">
						<value>
							<string>5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_668)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_670)">
						<value>
							<string>7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_672)">
						<value>
							<string>8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_674)">
						<value>
							<string>9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_676)">
						<value>
							<string>10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_678)">
						<value>
							<string>11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_680)">
						<value>
							<string>12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_682)">
						<value>
							<string>13</string>
						</value>
					</item>
					<item displayName="$(string.unknown_684)">
						<value>
							<string>14</string>
						</value>
					</item>
					<item displayName="$(string.unknown_686)">
						<value>
							<string>15</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_FastConnectAPI_Support" class="Machine" displayName="$(string.Policy_FastConnectAPI_Support)" explainText="$(string.Explain_FastConnectAPI_Support)" presentation="$(presentation.Policy_FastConnectAPI_Support)" key="SOFTWARE\Policies\Citrix\Dazzle">
			<parentCategory ref="Fast_Connect_API_Support"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Explain_FastConnectAPI_Functionality" valueName="FastConnectAPISupportEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Explain_EnableFastConnectTransitionAPI" valueName="EnableFastConnectTransitionAPI">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Explain_LeaveAppsRuningOnLogoff" valueName="LeaveAppsRuningOnLogoff">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Explain_FastConnectUsingSSP" valueName="FastConnectUsingSSP">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_EnableAutoUpdatePolicy" class="Machine" displayName="$(string.Policy_EnableAutoUpdatePolicy)" explainText="$(string.Explain_EnableAutoUpdatePolicy)" presentation="$(presentation.Policy_EnableAutoUpdatePolicy)" key="Software\Policies\Citrix\ICA Client\AutoUpdate">
			<parentCategory ref="AutoUpdate"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\AutoUpdate" valueName="Banned">
					<value>
						<delete/>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\AutoUpdate" valueName="Banned">
					<value>
						<string>True</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<enum id="Part_EnableAutoUpdatePolicy" valueName="Enable">
					<item displayName="$(string.AutoUpdate)">
						<value>
							<string>True</string>
						</value>
					</item>
					<item displayName="$(string.Manual)">
						<value>
							<string>False</string>
						</value>
					</item>
				</enum>
				<boolean id="Part_EnableAutoUpdatePolicy_version" valueName="LTSROnly">
					<trueValue>
						<string>True</string>
					</trueValue>
					<falseValue>
						<string>False</string>
					</falseValue>
				</boolean>
				<enum id="Part_EnableAutoUpdatePolicy_RemindMeLater" valueName="DeferUpdate-Count">
					<item displayName="$(string.MinusOne)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.Zero)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.One)">
						<value>
							<string>1</string>
						</value>
					</item>
					<item displayName="$(string.Two)">
						<value>
							<string>2</string>
						</value>
					</item>
					<item displayName="$(string.Three)">
						<value>
							<string>3</string>
						</value>
					</item>
					<item displayName="$(string.Four)">
						<value>
							<string>4</string>
						</value>
					</item>
					<item displayName="$(string.Five)">
						<value>
							<string>5</string>
						</value>
					</item>
					<item displayName="$(string.Six)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.Seven)">
						<value>
							<string>7</string>
						</value>
					</item>
					<item displayName="$(string.Eight)">
						<value>
							<string>8</string>
						</value>
					</item>
					<item displayName="$(string.Nine)">
						<value>
							<string>9</string>
						</value>
					</item>
					<item displayName="$(string.Ten)">
						<value>
							<string>10</string>
						</value>
					</item>
					<item displayName="$(string.Eleven)">
						<value>
							<string>11</string>
						</value>
					</item>
					<item displayName="$(string.Twelve)">
						<value>
							<string>12</string>
						</value>
					</item>
					<item displayName="$(string.Thirteen)">
						<value>
							<string>13</string>
						</value>
					</item>
					<item displayName="$(string.Fourteen)">
						<value>
							<string>14</string>
						</value>
					</item>
					<item displayName="$(string.Fifteen)">
						<value>
							<string>15</string>
						</value>
					</item>
					<item displayName="$(string.Sixteen)">
						<value>
							<string>16</string>
						</value>
					</item>
					<item displayName="$(string.Seventeen)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.Eighteen)">
						<value>
							<string>18</string>
						</value>
					</item>
					<item displayName="$(string.Nineteen)">
						<value>
							<string>19</string>
						</value>
					</item>
					<item displayName="$(string.Twenty)">
						<value>
							<string>20</string>
						</value>
					</item>
					<item displayName="$(string.TwentyOne)">
						<value>
							<string>21</string>
						</value>
					</item>
					<item displayName="$(string.TwentyTwo)">
						<value>
							<string>22</string>
						</value>
					</item>
					<item displayName="$(string.TwentyThree)">
						<value>
							<string>23</string>
						</value>
					</item>
					<item displayName="$(string.TwentyFour)">
						<value>
							<string>24</string>
						</value>
					</item>
					<item displayName="$(string.TwentyFive)">
						<value>
							<string>25</string>
						</value>
					</item>
					<item displayName="$(string.TwentySix)">
						<value>
							<string>26</string>
						</value>
					</item>
					<item displayName="$(string.TwentySeven)">
						<value>
							<string>27</string>
						</value>
					</item>
					<item displayName="$(string.TwentyEight)">
						<value>
							<string>28</string>
						</value>
					</item>
					<item displayName="$(string.TwentyNine)">
						<value>
							<string>29</string>
						</value>
					</item>
					<item displayName="$(string.Thirty)">
						<value>
							<string>30</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_CheckAutoUpdatePolicy" class="Machine" displayName="$(string.Policy_CheckAutoUpdatePolicy)" explainText="$(string.Explain_CheckAutoUpdatePolicy)" presentation="$(presentation.Policy_CheckAutoUpdatePolicy)" key="Software\Policies\Citrix\ICA Client\AutoUpdate">
			<parentCategory ref="AutoUpdate"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<elements>
				<enum id="Part_CheckAutoUpdatePolicy" valueName="BucketId">
					<item displayName="$(string.Fast)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.Medium)">
						<value>
							<string>4</string>
						</value>
					</item>
					<item displayName="$(string.Slow)">
						<value>
							<string>9</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_EngineErrMsg_1" class="User" displayName="$(string.Policy_EngineErrMsg)" explainText="$(string.Explain_EnableEngineErrMsg)" presentation="$(presentation.Policy_EngineErrMsg)" key="Software\Policies\Citrix\ICA Client\Engine" valueName="Enable_EngineErrMsg">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableICAClient_1" class="User" displayName="$(string.Policy_EnableICAClient)" explainText="$(string.Explain_EnableICAClient)" presentation="$(presentation.Policy_EnableICAClient_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions">
			<parentCategory ref="ICAClient"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<elements>
				<boolean id="Part_EnableICAClient_Enable" valueName="AllowConnection">
					<trueValue>
						<decimal value="1"/>
					</trueValue>
					<falseValue>
						<decimal value="0"/>
					</falseValue>
				</boolean>
				<decimal id="Part_EnableICAClient_Minimum" valueName="Version Minimum" minValue="10000" maxValue="100000" storeAsText="true"/>
			</elements>
		</policy>
		<policy name="Policy_SSLLockdown_1" class="User" displayName="$(string.Policy_SSLLockdown)" explainText="$(string.Explain_SSLLockdown)" presentation="$(presentation.Policy_SSLLockdown_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\SSL">
			<parentCategory ref="Network"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_SSL_EnabledLockdown" valueName="SSLEnable">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>*</string>
					</falseValue>
				</boolean>
				<enum id="Part_SSL_SecurityComplianceMode" valueName="SSLSecurityComplianceMode">
					<item displayName="$(string.unknown_1187)">
						<value>
							<string>NONE</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1191)">
						<value>
							<string>SP800-52</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1189)">
						<value>
							<string>FIPS</string>
						</value>
					</item>
				</enum>
				<text id="Part_SSL_SSLProxyHostLockdown" valueName="SSLProxyHost"/>
				<enum id="Part_SSL_SSLProtocolLockdown" valueName="SecureChannelProtocol">
					<item displayName="$(string.unknown_1203)">
						<value>
							<string>TLS12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1205)">
						<value>
							<string>TLS11_TLS12</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1207)">
						<value>
							<string>TLS11_TLS12_TLS13</string>
						</value>
					</item>
				</enum>
				<enum id="Part_SSL_CiphersetLockdown" valueName="SSLCiphers">
					<item displayName="$(string.unknown_1201)">
						<value>
							<string>
              </string>
						</value>
					</item>
					<item displayName="$(string.unknown_632)">
						<value>
							<string>GOV</string>
						</value>
					</item>
					<item displayName="$(string.unknown_634)">
						<value>
							<string>COM</string>
						</value>
					</item>
				</enum>
				<enum id="Part_SSL_RevocationLockdown" valueName="SSLCertificateRevocationCheckPolicy">
					<item displayName="$(string.unknown_638)">
						<value>
							<string>NoCheck</string>
						</value>
					</item>
					<item displayName="$(string.unknown_640)">
						<value>
							<string>CheckNoNetworkAccess</string>
						</value>
					</item>
					<item displayName="$(string.unknown_642)">
						<value>
							<string>FullAccessCheck</string>
						</value>
					</item>
					<item displayName="$(string.unknown_644)">
						<value>
							<string>FullAccessCheckAndCrlRequired</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1209)">
						<value>
							<string>FullAccessCheckAndCrlRequiredAll</string>
						</value>
					</item>
				</enum>
				<text id="Part_SSL_SSLPolicyOID" valueName="SSLPolicyExtensionOID"/>
				<enum id="Part_SSL_ClientAuthentication" valueName="SSLClientAuthentication">
					<item displayName="$(string.unknown_646)">
						<value>
							<string>
              </string>
						</value>
					</item>
					<item displayName="$(string.unknown_648)">
						<value>
							<string>AlwaysPromptUser</string>
						</value>
					</item>
					<item displayName="$(string.unknown_650)">
						<value>
							<string>Off</string>
						</value>
					</item>
					<item displayName="$(string.unknown_652)">
						<value>
							<string>On</string>
						</value>
					</item>
					<item displayName="$(string.unknown_654)">
						<value>
							<string>PromptUser</string>
						</value>
					</item>
				</enum>
				<text id="Part_SSL_ClientCertificate" valueName="SSLClientCertificate"/>
			</elements>
		</policy>
		<policy name="Policy_ConfigureClientSelectiveTrust_1" class="User" displayName="$(string.Policy_ConfigureClientSelectiveTrust)" explainText="$(string.Explain_ConfigureClientSelectiveTrust)" presentation="$(presentation.Policy_ConfigureClientSelectiveTrust_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\ClientSelectiveTrust">
			<parentCategory ref="Network"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_EnableClientSelectiveTrust" valueName="EnableClientSelectiveTrust">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>*</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_ClientAutoReconnect_1" class="User" displayName="$(string.Policy_ClientAutoReconnect)" explainText="$(string.Explain_ClientAutoReconnect)" presentation="$(presentation.Policy_ClientAutoReconnect_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Reconnection">
			<parentCategory ref="Network"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_ClientAutoReconnect_Reconnect" valueName="TransportReconnectEnabled">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_ClientAutoReconnect_CGP" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\CGP" valueName="CGPAddress">
					<trueValue>
						<string>
            </string>
					</trueValue>
					<falseValue>
						<string>0.0.0.0</string>
					</falseValue>
				</boolean>
				<decimal id="Part_ClientAutoReconnect_Dimming" storeAsText="true" valueName="NetDisruptBrightness" minValue="0" maxValue="100"/>
			</elements>
		</policy>
		<policy name="Policy_ProxyLockdown_1" class="User" displayName="$(string.Policy_ProxyLockdown)" explainText="$(string.Explain_ProxyLockdown)" presentation="$(presentation.Policy_ProxyLockdown_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Proxy">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_Proxy_ProxyTypeLockdown" valueName="ProxyType">
					<item displayName="$(string.ProxyType_Auto)">
						<value>
							<string>Auto</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_None)">
						<value>
							<string>None</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKS)">
						<value>
							<string>SOCKS</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKSv4)">
						<value>
							<string>SOCKSv4</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKSv5)">
						<value>
							<string>SOCKSv5</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_Secure)">
						<value>
							<string>Secure</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_Script)">
						<value>
							<string>Script</string>
						</value>
					</item>
				</enum>
				<text id="Part_Proxy_ProxyHostLockdown" valueName="ProxyHost"/>
				<text id="Part_Proxy_ProxyPortLockdown" valueName="ProxyPort"/>
				<text id="Part_Proxy_ProxyAutoConfigUrlLockdown" valueName="ProxyAutoConfigUrl"/>
				<text id="Part_Proxy_ProxyBypassListLockdown" valueName="ProxyBypassList"/>
			</elements>
		</policy>
		<policy name="Policy_AltProxyLockdown_1" class="User" displayName="$(string.Policy_AltProxyLockdown)" explainText="$(string.Explain_AltProxyLockdown)" presentation="$(presentation.Policy_AltProxyLockdown_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Proxy">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_AltProxy_ProxyTypeLockdown" valueName="AltProxyType">
					<item displayName="$(string.ProxyType_Auto)">
						<value>
							<string>Auto</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_None)">
						<value>
							<string>None</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKS)">
						<value>
							<string>SOCKS</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKSv4)">
						<value>
							<string>SOCKSv4</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_SOCKSv5)">
						<value>
							<string>SOCKSv5</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_Secure)">
						<value>
							<string>Secure</string>
						</value>
					</item>
					<item displayName="$(string.ProxyType_Script)">
						<value>
							<string>Script</string>
						</value>
					</item>
				</enum>
				<text id="Part_AltProxy_ProxyHostLockdown" valueName="AltProxyHost"/>
				<text id="Part_AltProxy_ProxyPortLockdown" valueName="AltProxyPort"/>
				<text id="Part_AltProxy_ProxyAutoConfigUrlLockdown" valueName="AltProxyAutoConfigUrl"/>
				<text id="Part_AltProxy_ProxyBypassListLockdown" valueName="AltProxyBypassList"/>
				<text id="Part_AltProxy_ProxyFallbackLockdown" valueName="ProxyFallback"/>
			</elements>
		</policy>
		<policy name="Policy_ProxySocks_1" class="User" displayName="$(string.Policy_ProxySocks)" explainText="$(string.Explain_ProxySocks)" presentation="$(presentation.Policy_ProxySocks_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Proxy">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_ProxySocks_Version" valueName="ICASOCKSProtocolVersion">
					<item displayName="$(string.unknown_608)">
						<value>
							<string>-1,default</string>
						</value>
					</item>
					<item displayName="$(string.unknown_610)">
						<value>
							<string>0,4,5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_612)">
						<value>
							<string>4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_614)">
						<value>
							<string>5</string>
						</value>
					</item>
				</enum>
				<text id="Part_ProxySocks_ProxyHostLockdown" valueName="ICASOCKSProxyHost"/>
				<text id="Part_ProxySOCKS_ProxyPortLockdown" valueName="ICASOCKSProxyPortNumber"/>
			</elements>
		</policy>
		<policy name="Policy_ProxyAuthentication_1" class="User" displayName="$(string.Policy_ProxyAuthentication)" explainText="$(string.Explain_ProxyAuthentication)" presentation="$(presentation.Policy_ProxyAuthentication_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Proxy">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Policy_ProxyExplicitAuthenticationEnabled" valueName="ProxyAuthenticationPrompt">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Policy_ProxyBasicAuthenticationEnabled" valueName="ProxyAuthenticationBasic">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Policy_ProxyNTLMAuthenticationEnabled" valueName="ProxyAuthenticationNTLM">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<text id="Part_Proxy_Socks5User" valueName="ProxyUsername"/>
				<text id="Part_Proxy_Socks5Password" valueName="ProxyPassword"/>
			</elements>
		</policy>
		<policy name="Policy_Smartcard_1" class="User" displayName="$(string.Policy_Smartcard)" explainText="$(string.Explain_Smartcard)" presentation="$(presentation.Policy_Smartcard)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Smartcard" valueName="SmartCardAllowed">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>*</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<elements>
				<boolean id="Part_Smartcard_Enable" valueName="SmartCardAllowed">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_SmartcardPin_Enable" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Smartcard" valueName="DisableCtrlAltDel">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>*</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_KerberosLockdown_1" class="User" displayName="$(string.Policy_KerberosLockdown)" explainText="$(string.Explain_KerberosLockdown)" presentation="$(presentation.Policy_KerberosLockdown_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Kerberos" valueName="SSPIEnabled">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="SSOnUserSetting">
					<value>
						<string>true,false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableSSOnThruICAFile">
					<value>
						<string>true</string>
					</value>
				</item>
			</enabledList>
		</policy>
		<policy name="Policy_DisablePersistentCookies_1" class="User" displayName="$(string.Policy_DisablePersistentCookies)" explainText="$(string.Explain_DisablePersistentCookies)" presentation="$(presentation.Policy_DisablePersistentCookies_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\PersistentCookies" valueName="Disabled">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_LocalCredentialsLockdown_1" class="User" displayName="$(string.Policy_LocalCredentialsLockdown)" explainText="$(string.Explain_LocalCredentialsLockdown)" presentation="$(presentation.Policy_LocalCredentialsLockdown_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="UseLocalUserAndPassword">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="SSOnUserSetting">
					<value>
						<string>true,false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableSSOnThruICAFile">
					<value>
						<string>true</string>
					</value>
				</item>
			</enabledList>
			<elements>
				<boolean id="Part_LocalCredentialsLockdown_Enable" valueName="UseLocalUserAndPassword">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
					<trueList>
						<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="SSOnUserSetting">
							<value>
								<string>true,false</string>
							</value>
						</item>
						<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableSSOnThruICAFile">
							<value>
								<string>true</string>
							</value>
						</item>
					</trueList>
					<falseList>
						<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="SSOnUserSetting">
							<value>
								<string>false</string>
							</value>
						</item>
						<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Local Credentials" valueName="EnableSSOnThruICAFile">
							<value>
								<string>false</string>
							</value>
						</item>
					</falseList>
				</boolean>
				<boolean id="Part_LegacyLocalUserNameAndPassword_Enable" valueName="LegacyLocalUserNameAndPassword">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_NovellCredentials" valueName="SSOnCredentialType">
					<trueValue>
						<string>NDS</string>
					</trueValue>
					<falseValue>
						<string>Any,NT,NDS</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_WITicket_1" class="User" displayName="$(string.Policy_WITicket)" explainText="$(string.Explain_WITicket)" presentation="$(presentation.Policy_WITicket_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Saved Credentials">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_WITicket_Legacy_Enable" valueName="ClearPassword">
					<trueValue>
						<string>
            </string>
					</trueValue>
					<falseValue>
						<string>xxxxxxxxx</string>
					</falseValue>
				</boolean>
				<boolean id="Part_WITicket_LogonTicket_Enable" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Logon\Ticket" valueName="LogonTicket">
					<trueValue>
						<string>
            </string>
					</trueValue>
					<falseValue>
						<string>xxxxxxxxx</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_SmartcardRemovalAction_x86" class="Machine" displayName="$(string.Policy_SmartcardRemovalAction_x86)" explainText="$(string.Explain_SmartCardRemovalAction_x86)" presentation="$(presentation.Policy_SmartcardRemovalAction)" key="SOFTWARE\Citrix\AuthManager" valueName="SmartCardRemovalAction">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform_SmartCardRemovalAction"/>
			<enabledValue>
				<string>ForceLogOff</string>
			</enabledValue>
			<disabledValue>
				<string>
        </string>
			</disabledValue>
		</policy>
		<policy name="Policy_SmartcardRemovalAction_AMD64" class="Machine" displayName="$(string.Policy_SmartcardRemovalAction_AMD64)" explainText="$(string.Explain_SmartCardRemovalAction_AMD64)" presentation="$(presentation.Policy_SmartcardRemovalAction)" key="SOFTWARE\wow6432node\Citrix\AuthManager" valueName="SmartCardRemovalAction">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform_SmartCardRemovalAction"/>
			<enabledValue>
				<string>ForceLogOff</string>
			</enabledValue>
			<disabledValue>
				<string>
        </string>
			</disabledValue>
		</policy>
		<policy name="Policy_EnableDriveMapping_1" class="User" displayName="$(string.Policy_EnableDriveMapping)" explainText="$(string.Explain_EnableDriveMapping)" presentation="$(presentation.Policy_EnableDriveMapping_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Drives">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_EnableDriveMappingCheckbox" valueName="CDMAllowed">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_EnableDriveMappingReadonly" valueName="CDMReadOnly">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false,true</string>
					</falseValue>
				</boolean>
				<text id="Part_EnableDriveMappingDisableDrives" valueName="DisableDrives"/>
			</elements>
		</policy>
		<policy name="Policy_EnablePrinterMapping_1" class="User" displayName="$(string.Policy_EnablePrinterMapping)" explainText="$(string.Explain_EnablePrinterMapping)" presentation="$(presentation.Policy_EnablePrinterMapping_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Printing" valueName="VSLAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_LocalPort_1" class="User" displayName="$(string.Policy_LocalPort)" explainText="$(string.Explain_LocalPort)" presentation="$(presentation.Policy_LocalPort_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="COMAllowed">
					<value>
						<string>false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="VirtualCOMPortEmulation">
					<value>
						<string>false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="CPMAllowed">
					<value>
						<string>false</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<text id="Part_MaxPort" valueName="MaxPort"/>
				<boolean id="Part_EnableSerialPortCheckbox" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="COMAllowed">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_EnableVirtualSerialPortCheckbox" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Serial Port" valueName="VirtualCOMPortEmulation">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_EnableParallelPortCheckbox" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Printing" valueName="CPMAllowed">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_ImageCapture_1" class="User" displayName="$(string.Policy_ImageCapture)" explainText="$(string.Explain_ImageCapture)" presentation="$(presentation.Policy_ImageCapture_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Image Capture" valueName="TWAINAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_AudioInput_1" class="User" displayName="$(string.Policy_AudioInput)" explainText="$(string.Explain_AudioInput)" presentation="$(presentation.Policy_AudioInput_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Audio" valueName="EnableAudioInput">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<elements>
				<boolean id="Part_BiDiAudio_Enable" valueName="EnableAudioInput">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Clipboard_1" class="User" displayName="$(string.Policy_Clipboard)" explainText="$(string.Explain_Clipboard)" presentation="$(presentation.Policy_Clipboard_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Clipboard" valueName="ClipboardAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_DragDrop_1" class="User" displayName="$(string.Policy_DragDrop)" explainText="$(string.Explain_DragDrop)" presentation="$(presentation.Policy_DragDrop_1)" key="Software\Policies\Citrix\ICA Client" valueName="DragDropAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_USB_PNP_Devices_1" class="User" displayName="$(string.Policy_USB_PNP_Devices)" explainText="$(string.Explain_USB_PNP_Devices)" presentation="$(presentation.Policy_USB_PNP_Devices_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\DVC_PlugAndPlay" valueName="PNPDeviceAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_PointOfSales_1" class="User" displayName="$(string.Policy_PointOfSales)" explainText="$(string.Explain_PointOfSales)" presentation="$(presentation.Policy_PointOfSales_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\DVC_PlugAndPlay" valueName="POSDeviceAllowed">
			<parentCategory ref="ClientDevices"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true,false</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_Audio_1" class="User" displayName="$(string.Policy_Audio)" explainText="$(string.Explain_Audio)" presentation="$(presentation.Policy_Audio_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Audio">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_Audio_Enabled" valueName="ClientAudio">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<enum id="Part_Audio_Quality" valueName="AudioBandwidthLimit">
					<item displayName="$(string.unknown_715)">
						<value>
							<string>0-</string>
						</value>
					</item>
					<item displayName="$(string.unknown_717)">
						<value>
							<string>1-</string>
						</value>
					</item>
					<item displayName="$(string.unknown_719)">
						<value>
							<string>2-</string>
						</value>
					</item>
				</enum>
				<boolean id="Part_RealtimeTransport_Enabled" valueName="EnableRtpAudio">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<decimal id="Part_RtpAudioLowestPort" valueName="RtpAudioLowestPort" minValue="16384" maxValue="65535" storeAsText="true"/>
				<decimal id="Part_RtpAudioHighestPort" valueName="RtpAudioHighestPort" minValue="16384" maxValue="65535" storeAsText="true"/>
				<boolean id="Part_RealtimeTransportThroughGateway_Enabled" valueName="EnableUDPThroughGateway">
					<trueValue>
						<string>true,false</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Graphics_1" class="User" displayName="$(string.Policy_Graphics)" explainText="$(string.Explain_Graphics)" presentation="$(presentation.Policy_Graphics_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Thinwire Graphics">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_Graphics_ColorDepth" valueName="DesiredColor">
					<item displayName="$(string.unknown_725)">
						<value>
							<string>4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_727)">
						<value>
							<string>8</string>
						</value>
					</item>
				</enum>
				<boolean id="Part_Graphics_DiskCache" valueName="PersistentCacheEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_ImageAcceleration" valueName="SpeedScreenIA">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_SpeedScreenBrowser" valueName="SpeedScreenBA">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_SpeedScreenBrowserCompression" valueName="SpeedScreenBACompressionEnabled">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_SpeedScreenMultimedia" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Multimedia" valueName="SpeedScreenMMA">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_ZeroLatencyKeyboard" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Zero Latency" valueName="ZLKeyboardMode">
					<trueValue>
						<string>2,1,0</string>
					</trueValue>
					<falseValue>
						<string>0</string>
					</falseValue>
				</boolean>
				<boolean id="Part_Graphics_ZeroLatencyMouse" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Zero Latency" valueName="ZLMouseMode">
					<trueValue>
						<string>2,1,0</string>
					</trueValue>
					<falseValue>
						<string>0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Display_1" class="User" displayName="$(string.Policy_Display)" explainText="$(string.Explain_Display)" presentation="$(presentation.Policy_Display_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Thinwire Graphics">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<text id="Part_Display_Seamless" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Seamless Windows" valueName="TWIMode"/>
				<text id="Part_Display_Width" valueName="DesiredHRES"/>
				<text id="Part_Display_Height" valueName="DesiredVRES"/>
				<enum id="Part_Display_Percent" valueName="ScreenPercent">
					<item displayName="$(string.unknown_743)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.unknown_745)">
						<value>
							<string>50</string>
						</value>
					</item>
					<item displayName="$(string.unknown_747)">
						<value>
							<string>75%</string>
						</value>
					</item>
					<item displayName="$(string.unknown_749)">
						<value>
							<string>
              </string>
						</value>
					</item>
				</enum>
				<text id="Part_Display_WorkArea" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Seamless Windows" valueName="TWIShrinkWorkArea"/>
				<boolean id="Part_Display_FullScreen" valueName="TWIFullScreenMode">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>*</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_LocalAppAccess_1" class="User" displayName="$(string.Policy_LocalAppAccess)" explainText="$(string.Explain_LocalAppAccess)" presentation="$(presentation.Policy_LocalAppAccess_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Control" valueName="ClientHostedAppsShortcuts">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Control" valueName="ClientHostedApps">
					<value>
						<string>*</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Seamless Windows" valueName="RTWIMode">
					<value>
						<string>*</string>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Control" valueName="ClientHostedApps">
					<value>
						<string>false</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Seamless Windows" valueName="RTWIMode">
					<value>
						<string>false</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<boolean id="Part_Allow_URLRedirection" valueName="ClientHostedAppsURLEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Keyboard_Hotkeys_1" class="User" displayName="$(string.Policy_Keyboard_Hotkeys)" explainText="$(string.Explain_Keyboard_Hotkeys)" presentation="$(presentation.Policy_Keyboard_Hotkeys_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\Hot Keys">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="Part_Keyboard_Hotkey_Tasklist" valueName="HotKey1Shift">
					<item displayName="$(string.unknown_767)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_769)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_771)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_773)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Tasklist_Plus" valueName="HotKey1Char">
					<item displayName="$(string.unknown_775)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_777)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_779)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_781)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_783)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_785)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_787)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_789)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_791)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_793)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_795)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_797)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_799)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_801)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_803)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_805)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_807)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Close_Remote_Application" valueName="HotKey2Shift">
					<item displayName="$(string.unknown_809)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_811)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_813)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_815)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Close_Remote_Application_Plus" valueName="HotKey2Char">
					<item displayName="$(string.unknown_817)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_819)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_821)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_823)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_825)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_827)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_829)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_831)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_833)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_835)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_837)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_839)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_841)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_843)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_845)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_847)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_849)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_Title_Bar" valueName="HotKey3Shift">
					<item displayName="$(string.unknown_851)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_853)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_855)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_857)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_Title_Bar_Plus" valueName="HotKey3Char">
					<item displayName="$(string.unknown_859)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_861)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_863)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_865)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_867)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_869)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_871)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_873)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_875)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_877)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_879)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_881)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_883)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_885)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_887)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_889)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_891)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Alt_Del" valueName="HotKey4Shift">
					<item displayName="$(string.unknown_893)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_895)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_897)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_899)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Alt_Del_Plus" valueName="HotKey4Char">
					<item displayName="$(string.unknown_901)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_903)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_905)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_907)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_909)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_911)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_913)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_915)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_917)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_919)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_921)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_923)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_925)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_927)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_929)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_931)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_933)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Shift_Esc" valueName="HotKey9Shift">
					<item displayName="$(string.unknown_935)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_937)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_939)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_941)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Shift_Esc_Plus" valueName="HotKey9Char">
					<item displayName="$(string.unknown_943)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_945)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_947)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_949)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_951)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_953)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_955)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_957)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_959)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_961)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_963)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_965)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_967)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_969)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_971)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_973)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_975)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Alt_Tab" valueName="HotKey7Shift">
					<item displayName="$(string.unknown_977)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_979)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_981)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_983)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Alt_Tab_Plus" valueName="HotKey7Char">
					<item displayName="$(string.unknown_985)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_987)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_989)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_991)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_993)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_995)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_997)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_999)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1001)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1003)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1005)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1007)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1009)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1011)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1013)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1015)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1017)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Alt_Backtab" valueName="HotKey8Shift">
					<item displayName="$(string.unknown_1019)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1021)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1023)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1025)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Alt_Backtab_Plus" valueName="HotKey8Char">
					<item displayName="$(string.unknown_1027)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1029)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1031)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1033)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1035)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1037)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1039)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1041)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1043)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1045)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1047)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1049)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1051)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1053)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1055)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1057)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1059)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Esc" valueName="HotKey5Shift">
					<item displayName="$(string.unknown_1061)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1063)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1065)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1067)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Esc_Plus" valueName="HotKey5Char">
					<item displayName="$(string.unknown_1069)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1071)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1073)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1075)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1077)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1079)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1081)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1083)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1085)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1087)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1089)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1091)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1093)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1095)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1097)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1099)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1101)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Alt" valueName="HotKey6Shift">
					<item displayName="$(string.unknown_1103)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1105)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1107)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1109)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Ctrl_Alt_Plus" valueName="HotKey6Char">
					<item displayName="$(string.unknown_1111)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1113)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1115)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1117)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1119)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1121)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1123)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1125)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1127)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1129)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1131)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1133)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1135)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1137)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1139)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1141)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1143)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_Latency_Reduction" valueName="HotKey10Shift">
					<item displayName="$(string.unknown_1145)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1147)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1149)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1151)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_Latency_Reduction_Plus" valueName="HotKey10Char">
					<item displayName="$(string.unknown_1153)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1155)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1157)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1159)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1161)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1163)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1165)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1167)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1169)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1171)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1173)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1175)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1177)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1179)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1181)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1183)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1185)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_LOCALIME" valueName="HotKey14Shift">
					<item displayName="$(string.unknown_1217)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1219)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1221)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1223)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Hotkey_Toggle_LOCALIME_Plus" valueName="HotKey14Char">
					<item displayName="$(string.unknown_1225)">
						<value>
							<string>(none)</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1227)">
						<value>
							<string>tab</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1229)">
						<value>
							<string>star</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1231)">
						<value>
							<string>plus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1233)">
						<value>
							<string>minus</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1235)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1237)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1239)">
						<value>
							<string>F3</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1241)">
						<value>
							<string>F4</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1243)">
						<value>
							<string>F5</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1245)">
						<value>
							<string>F6</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1247)">
						<value>
							<string>F7</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1249)">
						<value>
							<string>F8</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1251)">
						<value>
							<string>F9</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1253)">
						<value>
							<string>F10</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1255)">
						<value>
							<string>F11</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1257)">
						<value>
							<string>F12</string>
						</value>
					</item>
				</enum>
				<enum id="Part_Keyboard_Windows_Key" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Keyboard" valueName="TransparentKeyPassthrough">
					<item displayName="$(string.unknown_761)">
						<value>
							<string>Local</string>
						</value>
					</item>
					<item displayName="$(string.unknown_763)">
						<value>
							<string>Remote</string>
						</value>
					</item>
					<item displayName="$(string.unknown_765)">
						<value>
							<string>FullScreenOnly</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Keyboard_Settings_1" class="User" displayName="$(string.Policy_Keyboard_Settings)" explainText="$(string.Explain_Keyboard_Settings)" presentation="$(presentation.Policy_Keyboard_Settings_1)" key="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Keyboard">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledList defaultKey="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\GPO Disable\Keyboard">
				<item valueName="LocalIME">
					<value>
						<delete/>
					</value>
				</item>
				<item valueName="KeyboardSyncMode">
					<value>
						<delete/>
					</value>
				</item>
			</enabledList>
			<disabledList defaultKey="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\GPO Disable\Keyboard">
				<item valueName="LocalIME">
					<value>
						<string>0</string>
					</value>
				</item>
				<item valueName="KeyboardSyncMode">
					<value>
						<string>(User Profile)</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<enum id="Always_Sync_Keyboard_Layout" valueName="LocalIME">
					<item displayName="$(string.no_always_sync_keyboard_layout)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.yes_always_sync_keyboard_layout)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<enum id="Sync_Keyboard_Layout_Once" valueName="KeyboardSyncMode">
					<item displayName="$(string.sync_current_keyboard_layout_once)">
						<value>
							<string>(User Profile)</string>
						</value>
					</item>
					<item displayName="$(string.not_sync_keyboard_layout_once)">
						<value>
							<string>(Server Default)</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_IME_Settings_1" class="User" displayName="$(string.Policy_IME_Settings)" explainText="$(string.Explain_IME_Settings)" presentation="$(presentation.Policy_IME_Settings_1)" key="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Keyboard">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledList defaultKey="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\GPO Disable\Keyboard">
				<item valueName="DisableLanguageBar">
					<value>
						<delete/>
					</value>
				</item>
			</enabledList>
			<disabledList defaultKey="Software\Policies\Citrix\Ica Client\Engine\Lockdown Profiles\All Regions\Lockdown\GPO Disable\Keyboard">
				<item valueName="DisableLanguageBar">
					<value>
						<string>0</string>
					</value>
				</item>
			</disabledList>
			<elements>
				<enum id="Display_language_bar" valueName="DisableLanguageBar">
					<item displayName="$(string.yes)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.no_hide_language_bar)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_ToggleFullScreen" class="Machine" displayName="$(string.Policy_ToggleFullScreen)" explainText="$(string.Explain_Policy_ToggleFullScreen)" presentation="$(presentation.Policy_ToggleFullScreen)" key="Software\Policies\Citrix\ICA Client\THK" valueName="ToggleFullScreenEnabled">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
			<elements>
				<enum id="Part_ToggleFullScreen_FirstKey" valueName="FirstKey">
					<item displayName="$(string.unknown_769)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_771)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_773)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_ToggleFullScreen_SecondKey" valueName="SecondKey">
					<item displayName="$(string.unknown_769)">
						<value>
							<string>Shift</string>
						</value>
					</item>
					<item displayName="$(string.unknown_771)">
						<value>
							<string>Ctrl</string>
						</value>
					</item>
					<item displayName="$(string.unknown_773)">
						<value>
							<string>Alt</string>
						</value>
					</item>
				</enum>
				<enum id="Part_ToggleFullScreen_ThirdKey" valueName="ThirdKey">
					<item displayName="$(string.unknown_785)">
						<value>
							<string>F1</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1237)">
						<value>
							<string>F2</string>
						</value>
					</item>
					<item displayName="$(string.unknown_1239)">
						<value>
							<string>F3</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_PublishedApplications_1" class="User" displayName="$(string.Policy_PublishedApplications)" explainText="$(string.Explain_PublishedApplications)" presentation="$(presentation.Policy_PublishedApplications_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\Application Launching">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<elements>
				<text id="Part_PublishedApplications_InitialProgram" valueName="InitialProgram"/>
				<boolean id="Part_PublishedApplications_SessionSharing" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\Session Sharing" valueName="EnableSessionSharing">
					<trueValue>
						<string>*</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_HostRenderedAudio_1" class="User" displayName="$(string.Policy_HostRenderedAudio)" explainText="$(string.Explain_HostRenderedAudio)" presentation="$(presentation.Policy_HostRenderedAudio_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Virtual Channels\Audio" valueName="HostRenderedAudio">
			<parentCategory ref="UserExperience"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_ICAFileSettings_1" class="User" displayName="$(string.Policy_ICAFileSettings)" explainText="$(string.Explain_ICAFileSettings)" presentation="$(presentation.Policy_ICAFileSettings_1)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\ICA File">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Part_ICAFileSettings_RemoveICAFile" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Client Engine\ICA File" valueName="RemoveICAFile">
					<trueValue>
						<string>True</string>
					</trueValue>
					<falseValue>
						<string>False</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_AllowLegacySessionSharing" class="User" displayName="$(string.Policy_AllowLegacySessionSharing)" explainText="$(string.Explain_AllowLegacySessionSharing)" presentation="$(presentation.Policy_AllowLegacySessionSharing)" key="Software\Policies\Citrix\ICA Client">
			<parentCategory ref="ClientEngine"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<elements>
				<boolean id="Part_AllowLegacySessionSharing_SessionSharing" key="Software\Policies\Citrix\ICA Client" valueName="AllowLegacySessionSharing">
					<trueValue>
						<string>1</string>
					</trueValue>
					<falseValue>
						<string>0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_MSISettings_1" class="User" displayName="$(string.Policy_MSISettings)" explainText="$(string.Explain_MSISettings)" key="Software\Policies\Citrix\ICA Client\Engine\Lockdown Profiles\All Regions\Lockdown\Network\Multi-Stream" valueName="MSIEnabled">
			<parentCategory ref="MultiStreamICA"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>True</string>
			</enabledValue>
			<disabledValue>
				<string>False</string>
			</disabledValue>
		</policy>
		<!-- Start of ica-file-signing.admx-->
		<policy name="EnableICAFileSigning" class="Machine" displayName="$(string.unknown_0)" explainText="$(string.Explain_IcaFileSigning)" presentation="$(presentation.EnableICAFileSigning)" key="Software\Policies\Citrix\ICA Client\ICA File Signing">
			<parentCategory ref="CITRIX_COMPONENTS"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing" valueName="version">
					<value>
						<decimal value="1"/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing" valueName="enabled">
					<value>
						<decimal value="1"/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam1">
					<value>
						<string>Border</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam2">
					<value>
						<string>BackgroundColor</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam3">
					<value>
						<string>TextColor</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam4">
					<value>
						<string>DesiredColor</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam5">
					<value>
						<string>Client-Type</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam6">
					<value>
						<string>EnableIPCSessionControl</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam7">
					<value>
						<string>IconIndex</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam8">
					<value>
						<string>IconPath</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam9">
					<value>
						<string>TransportDriver</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam10">
					<value>
						<string>DesiredHRes</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam11">
					<value>
						<string>DesiredVRes</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam12">
					<value>
						<string>ScalingMode</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam13">
					<value>
						<string>TWIMode</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam14">
					<value>
						<string>ConnectionBar</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam15">
					<value>
						<string>RTWIMode</string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="disableCheckForTrustedLaunchers">
					<value>
						<decimal value="0"/>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing" valueName="version">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing" valueName="enabled">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam1">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam2">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam3">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam4">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam5">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam6">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam7">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam8">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam9">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam10">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam11">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam12">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam13">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam14">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="citrixparam15">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\ICA File Signing\Unsigned Parameters" valueName="disableCheckForTrustedLaunchers">
					<value>
						<delete/>
					</value>
				</item>
			</disabledList>
			<elements>
				<list id="TrustedCertificates" key="Software\Policies\Citrix\ICA Client\ICA File Signing\Trusted Certificates" valuePrefix="certificate" additive="true"/>
				<enum id="Securitypolicy" key="Software\Policies\Citrix\ICA Client\ICA File Signing" valueName="promptUser">
					<item displayName="$(string.unknown_16)">
						<value>
							<decimal value="0"/>
						</value>
					</item>
					<item displayName="$(string.unknown_17)">
						<value>
							<decimal value="1"/>
						</value>
					</item>
				</enum>
				<boolean id="TrustedLaunchers" key="Software\Policies\Citrix\ICA Client\ICA File Signing" valueName="disableCheckForTrustedLaunchers">
					<trueValue>
						<decimal value="1"/>
					</trueValue>
					<falseValue>
						<decimal value="0"/>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<!-- Start of NS LAN proxy.admx-->
		<policy name="POL_CONFIGURE_LAN_PROXY_MANUALLY" class="Machine" displayName="$(string.POL_CONFIGURE_LAN_PROXY_MANUALLY)" presentation="$(presentation.POL_CONFIGURE_LAN_PROXY_MANUALLY)" key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="StaticProxyEnabled" explainText="$(string.POL_CONFIGURE_LAN_PROXY_MANUALLY_Explain)">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyHost">
					<value>
						<string>
            </string>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyPort">
					<value>
						<decimal value="443"/>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyHost">
					<value>
						<delete/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyPort">
					<value>
						<delete/>
					</value>
				</item>
			</disabledList>
			<elements>
				<text id="TXT_PROXY_HOST" key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyHost" required="true" maxLength="255"/>
				<decimal id="TXT_PROXY_PORT" key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyPort" required="true" minValue="0" maxValue="65535"/>
			</elements>
		</policy>
		<policy name="POL_CONFIGURE_LAN_PROXY_DLL" class="Machine" displayName="$(string.POL_CONFIGURE_LAN_PROXY_DLL)" presentation="$(presentation.POL_CONFIGURE_LAN_PROXY_DLL)" key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="DynamicProxyEnabled" explainText="$(string.POL_CONFIGURE_LAN_PROXY_DLL_Explain)">
			<parentCategory ref="Proxy"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
			<enabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyChooserDLL">
					<value>
						<string>
            </string>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyChooserDLL">
					<value>
						<delete/>
					</value>
				</item>
			</disabledList>
			<elements>
				<text id="TXT_ProxyChooserDLL" key="Software\Policies\Citrix\ICA Client\Engine\Network Routing\Proxy\NetScaler LAN Proxy" valueName="ProxyChooserDLL" required="true" maxLength="260"/>
			</elements>
		</policy>
		<!-- Start of receiver_usb.admx-->
		<policy name="DeviceRules" class="Machine" displayName="$(string.DeviceRules)" explainText="$(string.DeviceRules_Explain)" presentation="$(presentation.DeviceRules)" key="Software\Policies\Citrix\ICA Client\GenericUSB">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<text id="DeviceRules_Value" valueName="DeviceRules"/>
			</elements>
		</policy>
		<policy name="ExistingDevices_Policy" class="Machine" displayName="$(string.ExistingDevices_Policy)" explainText="$(string.ExistingDevices_Explain)" presentation="$(presentation.ExistingDevices_Policy)" key="Software\Policies\Citrix\ICA Client\USB">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="ExistingDevices_Value" valueName="ExistingDevices">
					<item displayName="$(string.ExistingDevices_Always)">
						<value>
							<string>Always</string>
						</value>
					</item>
					<item displayName="$(string.ExistingDevices_Ask)">
						<value>
							<string>Ask</string>
						</value>
					</item>
					<item displayName="$(string.ExistingDevices_Ignore)">
						<value>
							<string>Ignore</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="NewDevices_Policy" class="Machine" displayName="$(string.NewDevices_Policy)" explainText="$(string.NewDevices_Explain)" presentation="$(presentation.NewDevices_Policy)" key="Software\Policies\Citrix\ICA Client\USB">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="NewDevices_Value" valueName="NewDevices">
					<item displayName="$(string.NewDevices_Always)">
						<value>
							<string>Always</string>
						</value>
					</item>
					<item displayName="$(string.NewDevices_Ask)">
						<value>
							<string>Ask</string>
						</value>
					</item>
					<item displayName="$(string.NewDevices_Ignore)">
						<value>
							<string>Ignore</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="HideSimpleDevices_Policy" class="Machine" displayName="$(string.HideSimpleDevices_Policy)" explainText="$(string.HideSimpleDevices_Explain)" presentation="$(presentation.HideSimpleDevices_Policy)" key="Software\Policies\Citrix\ICA Client\USB">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="HideSimpleDevices_Value" valueName="ShowAllDevices">
					<trueValue>
						<decimal value="0"/>
					</trueValue>
					<falseValue>
						<decimal value="1"/>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="ExistingDevices_Policy_1" class="User" displayName="$(string.ExistingDevices_Policy)" explainText="$(string.ExistingDevices_Explain)" presentation="$(presentation.ExistingDevices_Policy_1)" key="Software\Policies\Citrix\ICA Client\USB">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="ExistingDevices_Value" valueName="ExistingDevices">
					<item displayName="$(string.ExistingDevices_Always)">
						<value>
							<string>Always</string>
						</value>
					</item>
					<item displayName="$(string.ExistingDevices_Ask)">
						<value>
							<string>Ask</string>
						</value>
					</item>
					<item displayName="$(string.ExistingDevices_Ignore)">
						<value>
							<string>Ignore</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="NewDevices_Policy_1" class="User" displayName="$(string.NewDevices_Policy)" explainText="$(string.NewDevices_Explain)" presentation="$(presentation.NewDevices_Policy_1)" key="Software\Policies\Citrix\ICA Client\USB">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<enum id="NewDevices_Value" valueName="NewDevices">
					<item displayName="$(string.NewDevices_Always)">
						<value>
							<string>Always</string>
						</value>
					</item>
					<item displayName="$(string.NewDevices_Ask)">
						<value>
							<string>Ask</string>
						</value>
					</item>
					<item displayName="$(string.NewDevices_Ignore)">
						<value>
							<string>Ignore</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="HideSimpleDevices_Policy_1" class="User" displayName="$(string.HideSimpleDevices_Policy)" explainText="$(string.HideSimpleDevices_Explain)" presentation="$(presentation.HideSimpleDevices_Policy_1)" key="Software\Policies\Citrix\ICA Client\USB">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="HideSimpleDevices_Value" valueName="ShowAllDevices">
					<trueValue>
						<decimal value="0"/>
					</trueValue>
					<falseValue>
						<decimal value="1"/>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="RemoveOnLock" class="Machine" displayName="$(string.RemoveOnLock)" explainText="$(string.RemoveOnLock_Explain)" presentation="$(presentation.RemoveOnLock)" key="Software\Policies\Citrix\ICA Client\GenericUSB">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<text id="RemoveOnLock_Value" valueName="RemoveOnLock"/>
			</elements>
		</policy>
		<policy name="RedirectUnknownDevices" class="Machine" displayName="$(string.RedirectUnknownDevices)" explainText="$(string.RedirectUnknownDevices_Explain)" presentation="$(presentation.RedirectUnknownDevices)" key="Software\Policies\Citrix\ICA Client\GenericUSB" valueName="RedirectUnknownDevices">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="EnableUSBForceRedirection" class="Machine" displayName="$(string.EnableUSBForceRedirection)" explainText="$(string.EnableUSBForceRedirection_Explain)" presentation="$(presentation.EnableUSBForceRedirection)" key="Software\Policies\Citrix\ICA Client\GenericUSB" valueName="EnableUSBForceRedirection">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="SplitDevices" class="Machine" displayName="$(string.SplitDevices)" explainText="$(string.SplitDevices_Explain)" presentation="$(presentation.SplitDevices)" key="Software\Policies\Citrix\ICA Client\GenericUSB" valueName="SplitDevices">
			<parentCategory ref="GenericUSB"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_CitrixSecureBrowser_Cache" class="Machine" displayName="$(string.CitrixSecureBrowser_Cache)" explainText="$(string.Explain_CitrixSecureBrowser_Cache)" presentation="$(presentation.Presentation_CitrixSecureBrowser_Cache)" key="Software\Policies\Citrix\Secure Browser\" valueName="Cache">
			<parentCategory ref="CitrixSecureBrowser"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_AppProtectionAuthMan" class="Machine" displayName="$(string.Policy_AppProtectionAuthMan)" explainText="$(string.Explain_AppProtectionAuthMan)" presentation="$(presentation.Policy_AppProtectionAuthMan)" key="SOFTWARE\Policies\Citrix\AuthManager">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform_AppProtection"/>
			<elements>
				<boolean id="Explain_Antikeylogging" valueName="AntikeyloggingEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Explain_AntiScreenCapture" valueName="AntiScreenCaptureEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_AppProtectionSSP" class="Machine" displayName="$(string.Policy_AppProtectionSSP)" explainText="$(string.Explain_AppProtectionSSP)" presentation="$(presentation.Policy_AppProtectionSSP)" key="SOFTWARE\Policies\Citrix\Dazzle">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform_AppProtection"/>
			<elements>
				<boolean id="Explain_Antikeylogging" valueName="AntikeyloggingEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<boolean id="Explain_AntiScreenCapture" valueName="AntiScreenCaptureEnabled">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_StoreAuthenticationTokens" class="Machine" displayName="$(string.Policy_StoreAuthenticationTokens)" explainText="$(string.Explain_StoreAuthenticationTokens)" presentation="$(presentation.Policy_StoreAuthenticationTokens)" key="SOFTWARE\Policies\Citrix\Dazzle" valueName="StoreAuthenticationTokens">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_Enable_EdgeChromium" class="Machine" displayName="$(string.Policy_Enable_EdgeChromium)" explainText="$(string.Explain_Enable_EdgeChromium)" presentation="$(presentation.Policy_Enable_EdgeChromium)" key="Software\Policies\Citrix\AuthManager" valueName="EdgeChromiumEnabled">
			<parentCategory ref="Authentication"/>
			<supportedOn ref="SUPPORTED_Platform_EdgeChromium"/>
			<enabledValue>
				<string>true</string>
			</enabledValue>
			<disabledValue>
				<string>false</string>
			</disabledValue>
		</policy>
		<policy name="Policy_GlobalAppConfigService" class="Machine" displayName="$(string.Policy_GlobalAppConfigService)" explainText="$(string.Explain_GlobalAppConfigService)" presentation="$(presentation.Presentation_GlobalAppConfigService)" key="Software\Policies\Citrix\GlobalAppConfig">
			<parentCategory ref="GlobalAppConfig"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledList>
				<item key="Software\Policies\Citrix\GlobalAppConfig" valueName="configManagerEnabled">
					<value>
						<decimal value="1"/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\GlobalAppConfig" valueName="multiStorageConfigurationEnabled">
					<value>
						<decimal value="1"/>
					</value>
				</item>
			</enabledList>
			<disabledList>
				<item key="Software\Policies\Citrix\GlobalAppConfig" valueName="configManagerEnabled">
					<value>
						<decimal value="0"/>
					</value>
				</item>
				<item key="Software\Policies\Citrix\GlobalAppConfig" valueName="multiStorageConfigurationEnabled">
					<value>
						<decimal value="0"/>
					</value>
				</item>
			</disabledList>
		</policy>
		<policy name="Policy_LocalAppDiscovery" class="Machine" displayName="$(string.Policy_LocalAppDiscovery)" explainText="$(string.Explain_LocalAppDiscovery)" presentation="$(presentation.Presentation_LocalAppDiscovery)" key="Software\Policies\Citrix\Dazzle">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="EnableLocalAppDiscovery_Value" valueName="EnableLocalAppDiscovery">
					<trueValue>
						<string>true</string>
					</trueValue>
					<falseValue>
						<string>false</string>
					</falseValue>
				</boolean>
				<multiText id="LocalAppWhitelist_Value" valueName="LocalAppWhitelist"/>
			</elements>
		</policy>
		<policy name="Policy_LocalAppProtection" class="Machine" displayName="$(string.Policy_LocalAppProtection)" explainText="$(string.Explain_LocalAppProtection)" presentation="$(presentation.presentation_LocalAppProtection)" key="Software\Policies\Citrix\Dazzle">
			<parentCategory ref="SelfService"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<multiText id="LocalAppProtectionlist_Value" valueName="ProtectedLocalApplist"/>
			</elements>
		</policy>
		<policy name="Policy_EnableAntiDLLInjection" class="Machine" displayName="$(string.Policy_EnableAntiDLLInjection)" explainText="$(string.Explain_EnableAntiDLLInjection)" presentation="$(presentation.Presentation_EnableAntiDLLInjection)" key="SOFTWARE\Policies\Citrix\AppProtection">
			<parentCategory ref="AntiDLLInjection"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<elements>
				<boolean id="Explain_AntiDLLAuthmanager" valueName="EnableAntiDLLInjectionCitrixAuthManager">
					<trueValue>
						<decimal value="1"/>
					</trueValue>
					<falseValue>
						<decimal value="0"/>
					</falseValue>
				</boolean>
				<boolean id="Explain_AntiDLLSelfService" valueName="EnableAntiDLLInjectionCitrixWorkspaceappUI">
					<trueValue>
						<decimal value="1"/>
					</trueValue>
					<falseValue>
						<decimal value="0"/>
					</falseValue>
				</boolean>
				<boolean id="Explain_AntiDLLVirtualAppsandDesktops" valueName="EnableAntiDLLInjectionCVAD">
					<trueValue>
						<decimal value="1"/>
					</trueValue>
					<falseValue>
						<decimal value="0"/>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_AntiDLLModuleAllowList" class="Machine" displayName="$(string.Policy_AntiDLLModuleAllowList)" explainText="$(string.Explain_AntiDLLModuleAllowList)" presentation="$(presentation.presentation_AntiDLLModuleAllowList)" key="Software\Policies\Citrix\AppProtection">
			<parentCategory ref="AntiDLLInjection"/>
			<supportedOn ref="SUPPORTED_NotSpecified"/>
			<elements>
				<multiText id="AntiDLLModuleAllowList_Value" valueName="AntiDLLInjectionModuleAllowList"/>
			</elements>
		</policy>
		<policy name="Policy_BlockDoubleHopLaunch" class="Machine" displayName="$(string.Policy_BlockDoubleHopLaunch)" explainText="$(string.Explain_BlockDoubleHopLaunch)" presentation="$(presentation.Policy_BlockDoubleHopLaunch)" key="Software\Policies\Citrix\AppProtection" valueName="BlockDoubleHopLaunch">
			<parentCategory ref="AppProtection"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_CEBAvailableOutsideCWA" class="Machine" displayName="$(string.Policy_CEBAvailableOutsideCWA)" explainText="$(string.Explain_CEBAvailableOutsideCWA)" presentation="$(presentation.Policy_CEBAvailableOutsideCWA)" key="SOFTWARE\Policies\Citrix\CitrixEnterpriseBrowser" valueName="CEBShortcutEnabled">
			<parentCategory ref="CitrixEnterpriseBrowser"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="Policy_CEBAvailableOutsideCWA_1" class="User" displayName="$(string.Policy_CEBAvailableOutsideCWA)" explainText="$(string.Explain_CEBAvailableOutsideCWA)" presentation="$(presentation.Policy_CEBAvailableOutsideCWA)" key="SOFTWARE\Policies\Citrix\CitrixEnterpriseBrowser" valueName="CEBShortcutEnabled">
			<parentCategory ref="CitrixEnterpriseBrowser"/>
			<supportedOn ref="SUPPORTED_Platform"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
	</policies>
</policyDefinitions>